      *====================================================
       IDENTIFICATION                            DIVISION.
      *====================================================
       PROGRAM-ID. ACUMMES.
      *===================================================*
      *  AUTOR   : VICTOR LEAL                            *
      *  EMPRESA : FOURSYS                                *
      *  OBJETIVO: VETOR PARA MOSTRAR 12 MESES UTILIZANDO *
      *           OCCURS, REDEFINES ACUMULANDO VALORES    *
      *           POR MES                                 *
      *===================================================*
       ENVIRONMENT                               DIVISION.
      *====================================================
       CONFIGURATION                             SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *====================================================
       DATA                                      DIVISION.
      *====================================================
      *----------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------
       01 WRK-DADOS.
           05 WRK-MES       PIC 9(02) VALUE ZEROS.
           05 WRK-VALOR     PIC 9(05) VALUE ZEROS.
       01 FILLER.
           05 MES           PIC 9(06) OCCURS 12 TIMES.
      *----------------------------------------------------
       01 FILLER PIC X(48) VALUE
           '--------------VARIAVEIS ACUMULAR/CALCULAR----'.
      *----------------------------------------------------
       77 WRK-CONTADOR      PIC 9(02) VALUE ZEROS.
       77 WRK-TOTAL         PIC 9(06) VALUE ZEROS.
       77 WRK-REG-LIDOS     PIC 9(07) VALUE ZEROS.
      *====================================================
       PROCEDURE                                 DIVISION.
      *====================================================
      *----------------------------------------------------
       0000-PRINCIPAL                             SECTION.
      *----------------------------------------------------
           PERFORM 1000-INICIAR.
           PERFORM 2000-PROCESSAR UNTIL WRK-MES EQUAL 99.
           PERFORM 3000-FINALIZAR.
           STOP RUN.
      *-----------------------------------------------------
       0000-99-FIM.                                  EXIT.
      *-----------------------------------------------------

      *-----------------------------------------------------
       1000-INICIAR                               SECTION.
      *-----------------------------------------------------
            ACCEPT WRK-DADOS.
               IF WRK-MES LESS 1
                   DISPLAY 'FIM'
                   STOP RUN
               END-IF.
      *-----------------------------------------------------
       1000-99-FIM.                                  EXIT.
      *-----------------------------------------------------

      *-----------------------------------------------------
       2000-PROCESSAR                             SECTION.
      *-----------------------------------------------------
            ADD 1 TO WRK-REG-LIDOS.
            ADD WRK-VALOR TO WRK-TOTAL.
              ADD WRK-VALOR TO MES(WRK-MES)
            ACCEPT WRK-DADOS.
      *-----------------------------------------------------
       2000-99-FIM.                                  EXIT.
      *-----------------------------------------------------

      *-----------------------------------------------------
       3000-FINALIZAR                             SECTION.
      *-----------------------------------------------------
            PERFORM 3100-MOSTRAMES-A-MES.
            DISPLAY 'TOTAL GERAL:    '   WRK-TOTAL.
            DISPLAY 'TOTAL LIDOS:    '   WRK-REG-LIDOS.
      *-----------------------------------------------------
       3000-99-FIM.                                  EXIT.
      *-----------------------------------------------------

      *-----------------------------------------------------
       3100-MOSTRAMES-A-MES                       SECTION.
      *-----------------------------------------------------
            MOVE 1 TO WRK-CONTADOR.
            PERFORM 12 TIMES
             DISPLAY 'MES ' WRK-CONTADOR ' = ' MES(WRK-CONTADOR)
             ADD 1 TO WRK-CONTADOR
            END-PERFORM.
      *-----------------------------------------------------
       3100-99-FIM.                                  EXIT.
      *-----------------------------------------------------

      *-----------------------------------------------------
       9000-TRATAR-ERROS                          SECTION.
      *-----------------------------------------------------
      *-----------------------------------------------------
       9000-99-FIM.                                  EXIT.
      *-----------------------------------------------------
