      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ2201.                                             00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: ABRIR E FECHAR ARQUIVOS COM LRECL=34.  *             00080000
      *---------------------------------------------------*             00081000
      *  ARQUIVOS:                                        *             00082000
      *  DDNAME             I/O           INCLUDE/BOOK    *             00083000
      *  CLIENTES            I             ---------      *             00084000
      *===================================================*             00090000
                                                                        00100000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133100
       INPUT-OUTPUT                              SECTION.               00133200
       FILE-CONTROL.                                                    00133300
           SELECT CLIENTES ASSIGN TO JCLCLI                             00133400
               FILE STATUS IS WRK-FS-CLIENTES.                          00133500
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
      *----------------------------------------------------             00137100
       FILE                                       SECTION.              00137200
      *----------------------------------------------------             00137300
       FD CLIENTES                                                      00137400
           RECORDING MODE IS F                                          00137500
           BLOCK CONTAINS 0 RECORDS.                                    00137600
                                                                        00137700
       01 FD-CLIENTES.                                                  00137800
          05 FD-CODIGO PIC X(04).                                       00137900
          05 FD-NOME   PIC X(20).                                       00138000
          05 FD-BANCO  PIC X(10).                                       00138100
                                                                        00138200
      *----------------------------------------------------             00138300
       WORKING-STORAGE                            SECTION.              00138400
      *----------------------------------------------------             00138500
      *----------------------------------------------------             00138600
       01 FILLER PIC X(48) VALUE                                        00138700
           '--------------VARIAVEIS PARA FILE STATUS-----'.             00138800
      *----------------------------------------------------             00138900
       77 WRK-FS-CLIENTES      PIC 9(02).                               00151000
      *====================================================             00152000
       PROCEDURE                                 DIVISION.              00153000
      *====================================================             00154000
      *----------------------------------------------------             00155000
       0000-PRINCIPAL                             SECTION.              00156000
      *----------------------------------------------------             00157000
           PERFORM 1000-INICIALIZAR.                                    00157100
           PERFORM 2000-PROCESSAR.                                      00157200
           PERFORM 3000-FINALIZAR.                                      00157300
           STOP RUN.                                                    00157400
      *----------------------------------------------------             00157500
       0000-99-FIM.                                  EXIT.              00157600
      *----------------------------------------------------             00157700
                                                                        00157800
      *----------------------------------------------------             00158000
       1000-INICIALIZAR                           SECTION.              00158100
      *----------------------------------------------------             00158200
           OPEN INPUT CLIENTES.                                         00158300
            DISPLAY 'STATUS DA ABERTURA: ' WRK-FS-CLIENTES.             00158400
      *----------------------------------------------------             00158600
       1000-99-FIM.                                  EXIT.              00158700
      *----------------------------------------------------             00158800
                                                                        00158900
      *----------------------------------------------------             00159000
       2000-PROCESSAR                             SECTION.              00159100
      *----------------------------------------------------             00159200
           READ CLIENTES.                                               00159300
            DISPLAY 'STATUS DA LEITURA:  ' WRK-FS-CLIENTES.             00159400
            DISPLAY 'REGISTRO: ' FD-CLIENTES.                           00159600
      *----------------------------------------------------             00159800
       2000-99-FIM.                                  EXIT.              00159900
      *----------------------------------------------------             00160000
                                                                        00160700
      *----------------------------------------------------             00160800
       3000-FINALIZAR                             SECTION.              00160900
      *----------------------------------------------------             00161000
           CLOSE CLIENTES.                                              00161100
            DISPLAY 'STATUS DO FINAL:    ' WRK-FS-CLIENTES.             00161200
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00161400
      *----------------------------------------------------             00161500
       3000-99-FIM.                                  EXIT.              00162000
      *----------------------------------------------------             00163000
                                                                        00164000
      *----------------------------------------------------             00165000
       9000-TRATA-ERROS                           SECTION.              00166000
      *----------------------------------------------------             00167000
      *----------------------------------------------------             00168000
       9000-99-FIM.                                  EXIT.              00169000
      *-----------------------------------------------------            00170000
