      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ2203.                                             00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: ABRIR E FECHAR ARQUIVOS COM LRECL=48,  *             00080000
      *            TESTANDO FILE STATUS 00,10,35.         *             00081000
      *---------------------------------------------------*             00082000
      *  ARQUIVOS:                                        *             00083000
      *  DDNAME             I/O           INCLUDE/BOOK    *             00084000
      *  CLIENTES            I             ---------      *             00085000
      *====================================================             00090000
                                                                        00100000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133100
       INPUT-OUTPUT                              SECTION.               00133200
       FILE-CONTROL.                                                    00133300
           SELECT CLIENTES ASSIGN TO JCLCLI                             00133400
               FILE STATUS IS WRK-FS-CLIENTES.                          00133500
                                                                        00133600
      *====================================================             00133700
       DATA                                      DIVISION.              00133800
      *====================================================             00133900
      *----------------------------------------------------             00134000
       FILE                                      SECTION.               00135000
      *----------------------------------------------------             00136000
       FD CLIENTES                                                      00137000
           RECORDING MODE IS F                                          00137100
           BLOCK CONTAINS 0 RECORDS.                                    00137200
                                                                        00137300
       01 FD-CLIENTES.                                                  00137400
          05 FD-AGENCIA      PIC 9(04).                                 00137500
          05 FD-CONTA        PIC 9(05).                                 00137600
          05 FD-CORRENTISTA  PIC X(30).                                 00137700
          05 FD-VALOR        PIC 9(06)V99.                              00137800
          05 FD-TIPOOPERACAO PIC X(01).                                 00137900
                                                                        00138000
      *-----------------------------------------------------            00138100
       WORKING-STORAGE                           SECTION.               00138200
      *-----------------------------------------------------            00138300
      *-----------------------------------------------------            00138400
       01 FILLER PIC X(48) VALUE                                        00138500
           '--------------VARIAVEIS PARA MENSAGENS-------'.             00138600
      *-----------------------------------------------------            00138700
       77 WRK-MSG-OPEN       PIC X(30) VALUE 'STATUS OPEN '.            00138800
       77 WRK-MSG-CLOSE      PIC X(30) VALUE 'STATUS CLOSE'.            00138900
       77 WRK-MSG            PIC X(30) VALUE SPACES.                    00139000
      *-----------------------------------------------------            00139100
       01 FILLER PIC X(48) VALUE                                        00139200
           '--------------VARIAVEIS PARA FILE STATUS-----'.             00139300
      *-----------------------------------------------------            00139400
       77 WRK-FS-CLIENTES    PIC 9(02).                                 00139500
                                                                        00139600
      *====================================================             00139700
       PROCEDURE                                 DIVISION.              00139800
      *====================================================             00139900
      *-----------------------------------------------------            00140000
       0000-PRINCIPAL                             SECTION.              00150000
      *-----------------------------------------------------            00151000
           PERFORM 1000-INICIALIZAR.                                    00152000
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-CLIENTES                 00153000
                        EQUAL 10.                                       00153100
           PERFORM 3000-FINALIZAR.                                      00154000
           STOP RUN.                                                    00155000
      *-----------------------------------------------------            00156000
       0000-99-FIM.                                  EXIT.              00157000
      *-----------------------------------------------------            00157100
                                                                        00157200
      *-----------------------------------------------------            00157300
       1000-INICIALIZAR                           SECTION.              00157400
      *-----------------------------------------------------            00157500
           OPEN INPUT CLIENTES.                                         00157600
            MOVE WRK-MSG-OPEN TO WRK-MSG.                               00157700
            PERFORM 4000-TESTAR-STATUS.                                 00157800
             EVALUATE WRK-FS-CLIENTES                                   00157900
              WHEN 00                                                   00158000
               PERFORM 5000-TESTAR-VAZIO                                00158100
              WHEN 35                                                   00158200
               DISPLAY 'ARQUIVO NAO EXISTE'                             00158300
               STOP RUN                                                 00158400
              WHEN OTHER                                                00158500
               DISPLAY 'ERRO AO ABRIR: ' WRK-FS-CLIENTES                00158600
               STOP RUN                                                 00158700
              END-EVALUATE.                                             00158800
      *-----------------------------------------------------            00158900
       1000-99-FIM.                                  EXIT.              00159000
      *-----------------------------------------------------            00159100
                                                                        00159200
      *-----------------------------------------------------            00159300
       2000-PROCESSAR                             SECTION.              00159400
      *-----------------------------------------------------            00159500
           DISPLAY 'REGISTRO: ' FD-CLIENTES.                            00159600
            PERFORM 5000-TESTAR-VAZIO.                                  00159700
      *-----------------------------------------------------            00160000
       2000-99-FIM.                                  EXIT.              00160100
      *-----------------------------------------------------            00160200
                                                                        00160300
      *-----------------------------------------------------            00160400
       3000-FINALIZAR                             SECTION.              00160500
      *-----------------------------------------------------            00160600
           CLOSE CLIENTES.                                              00160700
            MOVE WRK-MSG-CLOSE TO WRK-MSG.                              00160800
            PERFORM 4000-TESTAR-STATUS.                                 00160900
             DISPLAY '----------FIM DO PROCESSAMENTO------'.            00161100
      *-----------------------------------------------------            00161200
       3000-99-FIM.                                  EXIT.              00161300
      *-----------------------------------------------------            00161400
                                                                        00161500
      *-----------------------------------------------------            00161600
       4000-TESTAR-STATUS                         SECTION.              00161700
      *-----------------------------------------------------            00161800
           DISPLAY '----------------'.                                  00161900
           DISPLAY WRK-MSG '=' WRK-FS-CLIENTES.                         00162000
           DISPLAY '----------------'.                                  00162100
      *-----------------------------------------------------            00162200
       4000-99-FIM.                                  EXIT.              00162300
      *-----------------------------------------------------            00162400
                                                                        00162500
      *-----------------------------------------------------            00162600
       5000-TESTAR-VAZIO                          SECTION.              00162700
      *-----------------------------------------------------            00162800
           READ CLIENTES.                                               00162900
            IF WRK-FS-CLIENTES EQUAL 10                                 00163000
             DISPLAY 'ARQUIVO VAZIO'                                    00163100
            END-IF.                                                     00163300
      *-----------------------------------------------------            00163500
       5000-99-FIM.                                  EXIT.              00163600
      *-----------------------------------------------------            00163700
                                                                        00163800
      *-----------------------------------------------------            00164300
       9000-TRATA-ERROS                           SECTION.              00164400
      *-----------------------------------------------------            00164500
      *-----------------------------------------------------            00164600
       9000-99-FIM.                                  EXIT.              00164700
      *-----------------------------------------------------            00165000
