      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ2202.                                             00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: ABRIR E FECHAR ARQUIVOS COM LRECL=48.  *             00080000
      *---------------------------------------------------*             00081000
      *  ARQUIVOS:                                        *             00082000
      *  DDNAME             I/O           INCLUDE/BOOK    *             00083000
      *  CLIENTES            I             ---------      *             00084000
      *===================================================*             00090000
                                                                        00100000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00133100
       INPUT-OUTPUT                              SECTION.               00133200
       FILE-CONTROL.                                                    00133300
           SELECT CLIENTES ASSIGN TO JCLCLI                             00133400
               FILE STATUS IS WRK-FS-CLIENTES.                          00133500
                                                                        00133600
      *====================================================             00133700
       DATA                                      DIVISION.              00133800
      *====================================================             00133900
      *----------------------------------------------------             00134000
       FILE                                      SECTION.               00135000
      *----------------------------------------------------             00136000
       FD CLIENTES                                                      00137000
           RECORDING MODE IS F                                          00137100
           BLOCK CONTAINS 0 RECORDS.                                    00137200
                                                                        00137300
       01 FD-CLIENTES.                                                  00137400
          05 FD-AGENCIA      PIC 9(04).                                 00137500
          05 FD-CONTA        PIC 9(05).                                 00137600
          05 FD-CORRENTISTA  PIC X(30).                                 00137700
          05 FD-VALOR        PIC 9(06)V99.                              00137800
          05 FD-TIPOOPERACAO PIC X(01).                                 00137900
                                                                        00138000
      *----------------------------------------------------             00138100
       WORKING-STORAGE                           SECTION.               00138200
      *----------------------------------------------------             00139000
      *----------------------------------------------------             00139100
       01 FILLER PIC X(48) VALUE                                        00139200
           '--------------VARIAVEIS PARA FILE STATUS-----'.             00139300
      *----------------------------------------------------             00139400
       77 WRK-FS-CLIENTES    PIC 9(02).                                 00140000
      *----------------------------------------------------             00141000
       01 FILLER PIC X(48) VALUE                                        00142000
           '--------------VARIAVEIS PARA MASCARA---------'.             00150000
      *----------------------------------------------------             00150100
       77 FD-VALOR-ED        PIC ZZZ.ZZ9,99.                            00150200
      *====================================================             00151000
       PROCEDURE                                 DIVISION.              00152000
      *====================================================             00153000
      *----------------------------------------------------             00154000
       0000-PRINCIPAL                             SECTION.              00155000
      *----------------------------------------------------             00156000
           PERFORM 1000-INICIALIZAR.                                    00157000
           PERFORM 2000-PROCESSAR.                                      00157100
           PERFORM 3000-FINALIZAR.                                      00157200
           STOP RUN.                                                    00157300
      *----------------------------------------------------             00157400
       0000-99-FIM.                                  EXIT.              00157500
      *----------------------------------------------------             00157600
                                                                        00157700
      *----------------------------------------------------             00157800
       1000-INICIALIZAR                           SECTION.              00157900
      *----------------------------------------------------             00158000
           OPEN INPUT CLIENTES.                                         00158100
            DISPLAY 'STATUS DA ABERTURA: ' WRK-FS-CLIENTES.             00158200
      *----------------------------------------------------             00158300
       1000-99-FIM.                                  EXIT.              00158400
      *----------------------------------------------------             00158500
                                                                        00158600
      *----------------------------------------------------             00158700
       2000-PROCESSAR                             SECTION.              00158800
      *----------------------------------------------------             00158900
           READ CLIENTES.                                               00159000
            DISPLAY 'STATUS DA LEITURA:  ' WRK-FS-CLIENTES.             00159100
            DISPLAY 'AGENCIA:         '    FD-AGENCIA.                  00159200
            DISPLAY 'CONTA:           '    FD-CONTA.                    00159300
            DISPLAY 'CORRENTISTA:     '    FD-CORRENTISTA.              00159400
            MOVE FD-VALOR TO FD-VALOR-ED.                               00159500
            DISPLAY 'VALOR:           '    FD-VALOR-ED.                 00159600
            DISPLAY 'TIPOOPERACAO:    '    FD-TIPOOPERACAO.             00159700
      *----------------------------------------------------             00159800
       2000-99-FIM.                                  EXIT.              00159900
      *----------------------------------------------------             00160000
                                                                        00160100
      *----------------------------------------------------             00160200
       3000-FINALIZAR                             SECTION.              00160300
      *----------------------------------------------------             00160400
           CLOSE CLIENTES.                                              00160500
            DISPLAY 'STATUS DO FINAL:    ' WRK-FS-CLIENTES.             00161000
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00161100
      *----------------------------------------------------             00161200
       3000-99-FIM.                                  EXIT.              00161300
      *----------------------------------------------------             00161400
                                                                        00161500
      *----------------------------------------------------             00161600
       9000-TRATA-ERROS                           SECTION.              00161700
      *----------------------------------------------------             00161800
      *----------------------------------------------------             00161900
       9000-99-FIM.                                  EXIT.              00162000
      *----------------------------------------------------             00163000
