      *====================================================
       IDENTIFICATION                            DIVISION.
      *====================================================
       PROGRAM-ID. CHAMAMES.
      *===================================================*
      *  AUTOR   : VICTOR LEAL                            *
      *  EMPRESA : FOURSYS                                *
      *  OBJETIVO: COMANDO CALL PARA UTILIZAR O ARQUIVO   *
      *            DEVOLMES.                              *
      *===================================================*

      *====================================================
       ENVIRONMENT                               DIVISION.
      *====================================================
       CONFIGURATION                             SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT  IS COMMA.

      *====================================================
       DATA                                      DIVISION.
      *====================================================
      *-----------------------------------------------------
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------
       77 WRK-DATA PIC X(30).

      *====================================================
       PROCEDURE                                 DIVISION.
      *====================================================
            CALL 'DEVOLMES' USING WRK-DATA.
             DISPLAY WRK-DATA.
            STOP RUN.
