      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00011000
      *====================================================             00012000
       PROGRAM-ID. F22COVSA.                                            00013000
      *===================================================*             00014000
      *  AUTOR   : VICTOR LEAL                            *             00015000
      *  EMPRESA : FOURSYS                                *             00016000
      *  OBJETIVO: PROGRAMA DE LINKAGE PARA MAPA BMS CICS *             00017003
      *            COM ACESSO AOS REGISTROS EM ARQUIVO    *             00018003
      *            VSAM.                                  *             00018103
      *---------------------------------------------------*             00018600
      *  BASE  DE DADOS:                                  *             00018700
      *  TABELA             I/O           INCLUDE/BOOK    *             00018800
      *  DFH310.CICS.FUNC    I             ---------      *             00018900
      *===================================================*             00019000
       DATA                                      DIVISION.              00020000
      *====================================================             00021000
      *-----------------------------------------------------            00022000
       WORKING-STORAGE                            SECTION.              00023000
      *-----------------------------------------------------            00024000
             COPY DFHAID.                                               00026000
                                                                        00027000
       01 WRK-DADOS.                                                    00028000
          05 WRK-CHAVE       PIC X(05).                                 00029000
          05 WRK-NOME        PIC X(30).                                 00030000
          05 WRK-SETOR       PIC X(04).                                 00040000
          05 WRK-SALARIO     PIC 9(08)V99.                              00050006
          05 WRK-DATAADM.                                               00051000
             10 WRK-DATADIA  PIC X(02).                                 00052000
             10 FILLER       PIC X(01).                                 00053000
             10 WRK-DATAMES  PIC X(02).                                 00054000
             10 FILLER       PIC X(01).                                 00055000
             10 WRK-DATAANO  PIC X(04).                                 00056000
          05 WRK-EMAIL       PIC X(40).                                 00057000
      *----------------------------------------------------             00057104
       01 FILLER PIC X(48) VALUE                                        00057204
           '--------------AREA VARIAVEL DE APOIO---------'.             00057304
      *----------------------------------------------------             00057404
                                                                        00058002
       77 WRK-RESP           PIC S9(04) COMP.                           00058102
      *-----------------------------------------------------            00058201
       LINKAGE                                    SECTION.              00058301
      *-----------------------------------------------------            00058401
       01 DFHCOMMAREA.                                                  00058501
          05 LNK-CHAVE       PIC X(05).                                 00058601
          05 LNK-NOME        PIC X(30).                                 00058701
          05 LNK-SETOR       PIC X(04).                                 00058801
          05 LNK-SALARIO     PIC 9(08)V99.                              00058906
          05 LNK-DATAADM.                                               00059001
             10 LNK-DATADIA  PIC X(02).                                 00059101
             10 FILLER       PIC X(01).                                 00059201
             10 LNK-DATAMES  PIC X(02).                                 00059301
             10 FILLER       PIC X(01).                                 00059401
             10 LNK-DATAANO  PIC X(04).                                 00059501
          05 LNK-EMAIL       PIC X(40).                                 00059601
          05 LNK-STATUS      PIC X(01).                                 00059701
      *====================================================             00060700
       PROCEDURE                                 DIVISION.              00060800
      *====================================================             00061000
      *-----------------------------------------------------            00070000
       0000-PRINCIPAL                             SECTION.              00071000
      *-----------------------------------------------------            00072000
           PERFORM 1000-INICIALIZAR.                                    00072104
           PERFORM 2000-PROCESSAR.                                      00072204
           PERFORM 3000-FINALIZAR.                                      00072304
           STOP RUN.                                                    00072404
      *-----------------------------------------------------            00072504
       0000-99-FIM.                                  EXIT.              00072604
      *-----------------------------------------------------            00072704
                                                                        00072804
      *-----------------------------------------------------            00072904
       1000-INICIALIZAR                           SECTION.              00073004
      *-----------------------------------------------------            00073104
            MOVE LNK-CHAVE TO WRK-CHAVE.                                00073207
      *-----------------------------------------------------            00073304
       0000-99-FIM.                                  EXIT.              00073404
      *-----------------------------------------------------            00073504
                                                                        00073604
      *-----------------------------------------------------            00073704
       2000-PROCESSAR                             SECTION.              00073807
      *-----------------------------------------------------            00073904
            EXEC CICS READ                                              00074101
                      FILE('FUNC')                                      00074201
                      RIDFLD(WRK-CHAVE)                                 00074301
                      INTO(WRK-DADOS)                                   00074401
                      RESP(WRK-RESP)                                    00074501
            END-EXEC.                                                   00074600
                                                                        00206000
            IF WRK-RESP EQUAL DFHRESP(NORMAL)                           00206103
             EVALUATE TRUE                                              00207001
              WHEN WRK-SALARIO EQUAL ZEROS                              00207102
               MOVE '3'                       TO LNK-STATUS             00207201
              WHEN WRK-EMAIL EQUAL SPACES                               00207302
               MOVE '4'                       TO LNK-STATUS             00207401
              WHEN OTHER                                                00208001
               MOVE WRK-NOME                  TO LNK-NOME               00209001
               MOVE WRK-SETOR                 TO LNK-SETOR              00210001
               MOVE WRK-SALARIO               TO LNK-SALARIO            00220001
               MOVE WRK-DATADIA               TO LNK-DATADIA            00230001
               MOVE WRK-DATAMES               TO LNK-DATAMES            00240001
               MOVE WRK-DATAANO               TO LNK-DATAANO            00250001
               MOVE WRK-EMAIL                 TO LNK-EMAIL              00251001
               MOVE '1'                       TO LNK-STATUS             00252001
             END-EVALUATE                                               00252102
            ELSE                                                        00253002
               MOVE '2'                       TO LNK-STATUS             00253101
            END-IF.                                                     00253302
      *-----------------------------------------------------            00253404
       2000-99-FIM.                                  EXIT.              00253504
      *-----------------------------------------------------            00253604
                                                                        00253704
      *-----------------------------------------------------            00253804
       3000-FINALIZAR                             SECTION.              00253904
      *-----------------------------------------------------            00254004
             EXEC CICS                                                  00254201
               RETURN                                                   00254301
             END-EXEC.                                                  00254401
      *-----------------------------------------------------            00254501
       3000-99-FIM.                                  EXIT.              00254604
      *-----------------------------------------------------            00254701
                                                                        00255001
