      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB26.                                            00040000
                                                                        00050000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: COMANDO DE REPETICAO PERFORM TIMES JUROS*             00081000
      *===================================================*             00082000
                                                                        00083000
      *====================================================             00084000
       ENVIRONMENT                               DIVISION.              00085000
      *====================================================             00086000
       CONFIGURATION                              SECTION.              00087000
       SPECIAL-NAMES.                                                   00088000
           DECIMAL-POINT IS COMMA.                                      00089000
                                                                        00090000
      *====================================================             00090100
       DATA                                      DIVISION.              00090200
      *====================================================             00090300
      *----------------------------------------------------             00090400
       WORKING-STORAGE                            SECTION.              00090500
      *----------------------------------------------------             00090600
       01 WRK-DADOS.                                                    00090700
          05 WRK-AGENCIA     PIC 9(04)    VALUE ZEROS.                  00090800
          05 WRK-CONTA       PIC 9(06)    VALUE ZEROS.                  00090900
          05 WRK-VALOR       PIC 9(04)V99 VALUE ZEROS.                  00091000
          05 WRK-MESES       PIC 9(02)    VALUE ZEROS.                  00091100
      *----------------------------------------------------             00091200
       01 FILLER PIC X(48) VALUE                                        00091300
           '--------------VARIAVEIS ACUMULAR/CALCULAR----'.             00091400
      *----------------------------------------------------             00091500
       77 WRK-COUNT          PIC 9(02)    VALUE 0.                      00091600
       77 WRK-TOTAL          PIC 9(06)V99 VALUE ZEROS.                  00091700
      *----------------------------------------------------             00091800
       01 FILLER PIC X(48) VALUE                                        00091900
           '--------------VARIAVEIS PARA MASCARA---------'.             00092000
      *----------------------------------------------------             00092100
       77 WRK-VALOR-ED       PIC ZZZ.ZZ9,99.                            00092200
       77 WRK-TOTAL-ED       PIC ZZZ.ZZ9,99.                            00092300
      *====================================================             00092400
       PROCEDURE                                 DIVISION.              00092500
      *====================================================             00092600
      *----------------------------------------------------             00092700
       0000-PRINCIPAL                             SECTION.              00092800
      *----------------------------------------------------             00092900
           PERFORM 1000-INICIALIZAR.                                    00093000
           PERFORM 2000-PROCESSAR.                                      00093100
           PERFORM 3000-FINALIZAR.                                      00093200
           STOP RUN.                                                    00093300
      *----------------------------------------------------             00093400
       0000-99-FIM.                                  EXIT.              00093500
      *----------------------------------------------------             00093600
                                                                        00093700
      *----------------------------------------------------             00093800
       1000-INICIALIZAR                           SECTION.              00093900
      *----------------------------------------------------             00094000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094100
      *----------------------------------------------------             00094200
       1000-99-FIM.                                  EXIT.              00094300
      *----------------------------------------------------             00094400
                                                                        00094500
      *----------------------------------------------------             00094600
       2000-PROCESSAR                             SECTION.              00094700
      *----------------------------------------------------             00094800
             DISPLAY 'AGENCIA        : ' WRK-AGENCIA.                   00094900
             DISPLAY 'CONTA          : ' WRK-CONTA.                     00095000
             MOVE WRK-VALOR TO WRK-VALOR-ED.                            00095100
             DISPLAY 'VALOR ORIGINAL : ' WRK-VALOR-ED.                  00095200
             DISPLAY 'MESES          : ' WRK-MESES.                     00095300
           PERFORM WRK-MESES TIMES                                      00095400
             COMPUTE WRK-TOTAL = WRK-VALOR * 1,05                       00095500
             MOVE WRK-TOTAL TO WRK-VALOR                                00095600
             ADD 1 TO WRK-COUNT                                         00095700
           END-PERFORM.                                                 00095800
             MOVE WRK-TOTAL TO WRK-TOTAL-ED.                            00095900
             DISPLAY 'CORRIGIDO      : ' WRK-TOTAL-ED.                  00096000
      *----------------------------------------------------             00096100
       2000-99-FIM.                                  EXIT.              00096200
      *----------------------------------------------------             00096300
                                                                        00096400
      *----------------------------------------------------             00096500
       3000-FINALIZAR                             SECTION.              00096600
      *----------------------------------------------------             00096700
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00096800
      *----------------------------------------------------             00096900
       3000-99-FIM.                                  EXIT.              00097000
      *----------------------------------------------------             00097100
                                                                        00097200
      *----------------------------------------------------             00097300
       9000-TRATA-ERROS                           SECTION.              00097400
      *----------------------------------------------------             00097500
      *----------------------------------------------------             00097600
       9000-99-FIM.                                  EXIT.              00097700
      *----------------------------------------------------             00097800
