      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22DB03.                                            00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060011
      *  EMPRESA : FOURSYS                                *             00070011
      *  OBJETIVO: INSERIR DADOS EM UMA TABELA USANDO DB2 *             00080000
      *---------------------------------------------------*             00080200
      *  BASE  DE DADOS:                                  *             00080300
      *  TABELA             I/O           INCLUDE/BOOK    *             00080400
      *  IVAN.FUNC           I               #BKFUNC      *             00080500
      *===================================================*             00080600
                                                                        00080700
      *====================================================             00080800
       ENVIRONMENT                               DIVISION.              00080900
      *====================================================             00081000
       CONFIGURATION                             SECTION.               00082000
       SPECIAL-NAMES.                                                   00083000
           DECIMAL-POINT  IS COMMA.                                     00084000
                                                                        00085000
      *====================================================             00086000
       DATA                                      DIVISION.              00087000
      *====================================================             00088000
      *----------------------------------------------------             00089000
       FILE                                      SECTION.               00090000
      *----------------------------------------------------             00100000
                                                                        00110000
      *-----------------------------------------------------            00120000
       WORKING-STORAGE                           SECTION.               00130000
      *-----------------------------------------------------            00131000
           EXEC SQL                                                     00132000
              INCLUDE #BKFUNC                                           00133000
           END-EXEC.                                                    00134000
                                                                        00135000
           EXEC SQL                                                     00136000
              INCLUDE SQLCA                                             00137000
           END-EXEC.                                                    00137100
                                                                        00137210
       77 WRK-SQLCODE        PIC -999.                                  00138100
                                                                        00138300
       01 WRK-ID.                                                       00138400
          02 FILLER          PIC X(10).                                 00138500
          02 WRK-ID-AC       PIC 9(05).                                 00138609
                                                                        00138700
       01 WRK-NOME.                                                     00138800
          02 FILLER          PIC X(10).                                 00138900
          02 WRK-NOME-AC     PIC X(30).                                 00139001
                                                                        00139100
       01 WRK-SETOR.                                                    00139200
          02 FILLER          PIC X(10).                                 00139300
          02 WRK-SETOR-AC    PIC X(04).                                 00139401
                                                                        00139500
       01 WRK-SALARIO.                                                  00139600
          02 FILLER          PIC X(10).                                 00139706
          02 WRK-SALARIO-AC  PIC 9(08)V9(02).                           00139809
                                                                        00139900
       01 WRK-DATAADM.                                                  00140000
          02 FILLER          PIC X(10).                                 00140100
          02 WRK-DATAADM-AC  PIC X(10).                                 00140201
                                                                        00140300
       01 WRK-EMAIL.                                                    00140400
          02 FILLER          PIC X(10).                                 00140500
          02 WRK-EMAIL-AC    PIC X(40).                                 00140601
      *====================================================             00140700
       PROCEDURE                                 DIVISION.              00140800
      *====================================================             00140900
      *-----------------------------------------------------            00141000
       0000-PRINCIPAL                             SECTION.              00141100
      *-----------------------------------------------------            00141200
           PERFORM 1000-INICIALIZAR.                                    00141300
           PERFORM 2000-PROCESSAR.                                      00141400
           PERFORM 3000-FINALIZAR.                                      00141500
           STOP RUN.                                                    00141600
      *-----------------------------------------------------            00141700
       0000-99-FIM.                                  EXIT.              00141800
      *-----------------------------------------------------            00141900
                                                                        00142000
      *-----------------------------------------------------            00142100
       1000-INICIALIZAR                           SECTION.              00142200
      *-----------------------------------------------------            00142300
           ACCEPT WRK-ID.                                               00142400
           ACCEPT WRK-NOME.                                             00142500
           ACCEPT WRK-SETOR.                                            00142600
           ACCEPT WRK-SALARIO.                                          00142703
           ACCEPT WRK-DATAADM.                                          00142800
           ACCEPT WRK-EMAIL.                                            00142900
      *-----------------------------------------------------            00144500
       1000-99-FIM.                                  EXIT.              00144600
      *-----------------------------------------------------            00144700
                                                                        00144800
      *-----------------------------------------------------            00144900
       2000-PROCESSAR                             SECTION.              00145000
      *-----------------------------------------------------            00145100
           MOVE WRK-ID-AC      TO DB2-ID.                               00145300
           MOVE WRK-NOME-AC    TO DB2-NOME.                             00145400
           MOVE WRK-SETOR-AC   TO DB2-SETOR.                            00145500
           MOVE WRK-SALARIO-AC TO DB2-SALARIO.                          00145600
           MOVE WRK-DATAADM-AC TO DB2-DATAADM.                          00145700
           MOVE WRK-EMAIL-AC   TO DB2-EMAIL.                            00145804
                                                                        00145900
           EXEC SQL                                                     00146000
            INSERT INTO                                                 00146100
             IVAN.FUNC(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)             00146200
            VALUES (:DB2-ID,                                            00146300
                    :DB2-NOME,                                          00146400
                    :DB2-SETOR,                                         00146500
                    :DB2-SALARIO,                                       00146600
                    :DB2-DATAADM,                                       00146700
                    :DB2-EMAIL)                                         00146800
           END-EXEC.                                                    00146900
                                                                        00147400
           EVALUATE SQLCODE                                             00147500
            WHEN 0                                                      00147600
             DISPLAY 'DADOS GRAVADOS'                                   00147700
             DISPLAY 'ID:'      DB2-ID                                  00147800
             DISPLAY 'NOME:'    DB2-NOME                                00147900
             DISPLAY 'SETOR:'   DB2-SETOR                               00148000
             DISPLAY 'SALARIO:' DB2-SALARIO                             00148100
             DISPLAY 'DATAADM:' DB2-DATAADM                             00148200
             DISPLAY 'EMAIL:'   DB2-EMAIL                               00148300
            WHEN -181                                                   00148400
             DISPLAY 'DATA FORMATO ERRADO' WRK-DATAADM-AC               00148502
            WHEN OTHER                                                  00148600
             MOVE SQLCODE TO WRK-SQLCODE                                00148700
             DISPLAY 'ERRO'  WRK-SQLCODE                                00148800
           END-EVALUATE.                                                00148900
      *-----------------------------------------------------            00149000
       2000-99-FIM.                                  EXIT.              00149100
      *-----------------------------------------------------            00149200
                                                                        00149300
      *-----------------------------------------------------            00149400
       3000-FINALIZAR                             SECTION.              00149500
      *-----------------------------------------------------            00149600
           DISPLAY 'FIM DE PROCESSAMENTO'.                              00150000
      *-----------------------------------------------------            00160200
       3000-99-FIM.                                  EXIT.              00160300
      *-----------------------------------------------------            00160400
