      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22DB04.                                            00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060001
      *  EMPRESA : FOURSYS                                *             00070001
      *  OBJETIVO: DELETAR  DADO EM UMA TABELA USANDO DB2 *             00080000
      *---------------------------------------------------*             00080100
      *  BASE  DE DADOS:                                  *             00080200
      *  TABELA             I/O           INCLUDE/BOOK    *             00080300
      *  IVAN.FUNC           I               #BKFUNC      *             00080400
      *===================================================*             00080500
                                                                        00080600
      *====================================================             00080700
       ENVIRONMENT                               DIVISION.              00080800
      *====================================================             00080900
       CONFIGURATION                             SECTION.               00081000
       SPECIAL-NAMES.                                                   00082000
           DECIMAL-POINT  IS COMMA.                                     00083000
                                                                        00084000
      *====================================================             00085000
       DATA                                      DIVISION.              00086000
      *====================================================             00087000
      *----------------------------------------------------             00088000
       FILE                                      SECTION.               00089000
      *----------------------------------------------------             00090000
                                                                        00100000
      *-----------------------------------------------------            00110000
       WORKING-STORAGE                           SECTION.               00120000
      *-----------------------------------------------------            00130000
           EXEC SQL                                                     00131000
              INCLUDE #BKFUNC                                           00132000
           END-EXEC.                                                    00133000
                                                                        00134000
           EXEC SQL                                                     00135000
              INCLUDE SQLCA                                             00136000
           END-EXEC.                                                    00137000
                                                                        00137100
      *----------------------------------------------------             00137201
       01 FILLER PIC X(48) VALUE                                        00137301
           '--------------VARIAVEIS PARA APOIO-----------'.             00137401
      *----------------------------------------------------             00137501
       77 WRK-ID             PIC 9(05).                                 00137600
       77 WRK-SQLCODE        PIC -999.                                  00137700
      *====================================================             00140700
       PROCEDURE                                 DIVISION.              00140800
      *====================================================             00140900
      *-----------------------------------------------------            00141000
       0000-PRINCIPAL                             SECTION.              00141100
      *-----------------------------------------------------            00141200
           PERFORM 1000-INICIALIZAR.                                    00141300
           PERFORM 2000-PROCESSAR.                                      00141400
           PERFORM 3000-FINALIZAR.                                      00141500
           STOP RUN.                                                    00141600
      *-----------------------------------------------------            00141700
       0000-99-FIM.                                  EXIT.              00141800
      *-----------------------------------------------------            00141900
                                                                        00142000
      *-----------------------------------------------------            00142100
       1000-INICIALIZAR                           SECTION.              00142200
      *-----------------------------------------------------            00142300
           ACCEPT WRK-ID FROM SYSIN.                                    00142400
           MOVE WRK-ID TO DB2-ID.                                       00142500
      *-----------------------------------------------------            00143000
       1000-99-FIM.                                  EXIT.              00144000
      *-----------------------------------------------------            00144100
                                                                        00144200
      *-----------------------------------------------------            00144300
       2000-PROCESSAR                             SECTION.              00144400
      *-----------------------------------------------------            00144500
           EXEC SQL                                                     00145300
            DELETE FROM IVAN.FUNC                                       00145400
            WHERE ID = :DB2-ID                                          00145500
           END-EXEC.                                                    00146200
                                                                        00146300
           EVALUATE SQLCODE                                             00146400
            WHEN 0                                                      00146500
             DISPLAY 'REGISTRO ' WRK-ID ' EXCLUIDO COM SUCESSO'         00146600
            WHEN 100                                                    00148200
             DISPLAY WRK-ID ' NAO ENCONTRADO'                           00148300
            WHEN OTHER                                                  00148400
             MOVE SQLCODE TO WRK-SQLCODE                                00148500
             DISPLAY 'ERRO'  WRK-SQLCODE                                00148600
           END-EVALUATE.                                                00148700
      *-----------------------------------------------------            00148800
       2000-99-FIM.                                  EXIT.              00148900
      *-----------------------------------------------------            00149000
                                                                        00149100
      *-----------------------------------------------------            00149200
       3000-FINALIZAR                             SECTION.              00149300
      *-----------------------------------------------------            00149400
           DISPLAY 'FIM DE PROCESSAMENTO'.                              00149500
      *-----------------------------------------------------            00149600
       3000-99-FIM.                                  EXIT.              00149700
      *-----------------------------------------------------            00149800
