      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB15.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: COMPUTE MEDIA                           *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-CODIGOLOJA   PIC 9(03)    VALUE ZEROS.                 00091600
          05 WRK-PRODUTO      PIC X(30)    VALUE SPACES.                00091700
          05 WRK-QTVENDAS     PIC 9(03)    VALUE ZEROS.                 00091800
          05 WRK-VALORUNIT    PIC 9(05)V99 VALUE ZEROS.                 00091900
                                                                        00092000
      *----------------------------------------------------             00092100
       01 FILLER PIC X(48) VALUE                                        00092200
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092300
      *----------------------------------------------------             00092400
       77 WRK-VALORUNIT-ED    PIC ZZ.ZZ9,99.                            00092500
       77 WRK-TOTAL           PIC 9(06)V99 VALUE ZEROS.                 00092600
       77 WRK-TOTAL-ED        PIC ZZZ.ZZ9,99.                           00092700
      *====================================================             00092800
       PROCEDURE                                 DIVISION.              00092900
      *====================================================             00093000
      *----------------------------------------------------             00093100
       0000-PRINCIPAL                             SECTION.              00093200
      *----------------------------------------------------             00093300
           PERFORM 1000-INICIALIZAR.                                    00093400
           PERFORM 2000-PROCESSAR.                                      00093500
           PERFORM 3000-FINALIZAR.                                      00093600
           STOP RUN.                                                    00093700
      *----------------------------------------------------             00093800
       0000-99-FIM.                                  EXIT.              00093900
      *----------------------------------------------------             00094000
                                                                        00094100
      *----------------------------------------------------             00094200
       1000-INICIALIZAR                           SECTION.              00094300
      *----------------------------------------------------             00094400
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094500
      *----------------------------------------------------             00094600
       1000-99-FIM.                                  EXIT.              00094700
      *----------------------------------------------------             00094800
                                                                        00094900
      *----------------------------------------------------             00095000
       2000-PROCESSAR                             SECTION.              00095100
      *----------------------------------------------------             00095200
           DISPLAY 'WRK-CODIGOLOJA:   '   WRK-CODIGOLOJA.               00095300
           DISPLAY 'WRK-PRODUTO   :   '   WRK-PRODUTO.                  00095400
           DISPLAY 'WRK-QTVENDAS  :   '   WRK-QTVENDAS.                 00095500
            MOVE WRK-VALORUNIT TO WRK-VALORUNIT-ED.                     00095600
           DISPLAY 'WRK-VALORUNIT-ED: '   WRK-VALORUNIT-ED.             00095700
            MULTIPLY WRK-QTVENDAS BY WRK-VALORUNIT GIVING WRK-TOTAL.    00095800
            COMPUTE WRK-TOTAL = ( WRK-QTVENDAS * WRK-VALORUNIT ) / 5.   00095900
            MOVE WRK-TOTAL TO WRK-TOTAL-ED.                             00096000
           DISPLAY 'MEDIA DE VENDAS POR DIA:' WRK-TOTAL-ED.             00096100
      *----------------------------------------------------             00096200
       2000-99-FIM.                                  EXIT.              00096300
      *----------------------------------------------------             00096400
                                                                        00096500
      *----------------------------------------------------             00096600
       3000-FINALIZAR                             SECTION.              00096700
      *----------------------------------------------------             00096800
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
