      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB05.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: UTILIZANDO DATA                         *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
                                                                        00090500
      *====================================================             00090600
       DATA                                      DIVISION.              00090700
      *====================================================             00090800
      *----------------------------------------------------             00090900
       WORKING-STORAGE                           SECTION.               00091000
      *----------------------------------------------------             00091100
       01 WRK-DATA.                                                     00091200
          05 WRK-ANO     PIC 9(04) VALUE ZEROS.                         00091300
          05 WRK-MES     PIC 9(02) VALUE ZEROS.                         00091400
          05 WRK-DIA     PIC 9(02) VALUE ZEROS.                         00091500
      *====================================================             00091600
       PROCEDURE                                 DIVISION.              00091700
      *====================================================             00091800
      *----------------------------------------------------             00091900
       0000-PRINCIPAL                             SECTION.              00092000
      *----------------------------------------------------             00092100
           PERFORM 1000-INICIALIZAR.                                    00092200
           PERFORM 2000-PROCESSAR.                                      00092300
           PERFORM 3000-FINALIZAR.                                      00092400
           STOP RUN.                                                    00092500
      *----------------------------------------------------             00092600
       0000-99-FIM.                                  EXIT.              00092700
      *----------------------------------------------------             00092800
                                                                        00092900
      *----------------------------------------------------             00093000
       1000-INICIALIZAR                           SECTION.              00093100
      *----------------------------------------------------             00093200
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.                          00093300
      *----------------------------------------------------             00093400
       1000-99-FIM.                                  EXIT.              00093500
      *----------------------------------------------------             00093600
                                                                        00093700
      *----------------------------------------------------             00093800
       2000-PROCESSAR                             SECTION.              00093900
      *----------------------------------------------------             00094000
           DISPLAY 'OURINHOS, ' WRK-DIA ' DE ' WRK-MES                  00094100
                   ' DE ' WRK-ANO.                                      00094200
      *----------------------------------------------------             00094300
       2000-99-FIM.                                  EXIT.              00094400
      *----------------------------------------------------             00094500
                                                                        00094600
      *----------------------------------------------------             00094700
       3000-FINALIZAR                             SECTION.              00094800
      *----------------------------------------------------             00094900
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00095000
      *----------------------------------------------------             00096000
       3000-99-FIM.                                  EXIT.              00097000
      *----------------------------------------------------             00098000
