      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB07.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: REDEFINE COM FILLER QUEBRANDO UMA       *             00081000
      *           VARIAVEL.                               *             00082000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
                                                                        00090500
      *====================================================             00090600
       DATA                                      DIVISION.              00090700
      *====================================================             00090800
      *----------------------------------------------------             00090900
       WORKING-STORAGE                           SECTION.               00091000
      *----------------------------------------------------             00091100
       01 WRK-DADOS.                                                    00091200
          05 WRK-ID            PIC 9(05) VALUE ZEROS.                   00091300
          05 WRK-NOME          PIC X(19) VALUE SPACES.                  00091400
          05 WRK-RUA           PIC X(20) VALUE SPACES.                  00091500
          05 WRK-BAIRRO        PIC X(10) VALUE SPACES.                  00091600
          05 WRK-ESTADO        PIC X(10) VALUE SPACES.                  00091700
                                                                        00091800
       01 WRK-DADOS-1          REDEFINES WRK-DADOS.                     00091900
          05 FILLER            PIC X(24).                               00092000
          05 WRK-ENDERECOCOMP.                                          00092100
           10 WRK-RUA-1        PIC X(20).                               00092200
           10 WRK-BAIRRO-1     PIC X(10).                               00092300
           10 WRK-ESTADO-1     PIC X(10).                               00092400
                                                                        00092700
      *====================================================             00092800
       PROCEDURE                                 DIVISION.              00092900
      *====================================================             00093000
      *----------------------------------------------------             00093100
       0000-PRINCIPAL                             SECTION.              00093200
      *----------------------------------------------------             00093300
           PERFORM 1000-INICIALIZAR.                                    00093400
           PERFORM 2000-PROCESSAR.                                      00093500
           PERFORM 3000-FINALIZAR.                                      00093600
           STOP RUN.                                                    00093700
      *----------------------------------------------------             00093900
       0000-99-FIM.                                  EXIT.              00094000
      *----------------------------------------------------             00094100
                                                                        00094200
      *----------------------------------------------------             00094300
       1000-INICIALIZAR                           SECTION.              00094400
      *----------------------------------------------------             00094500
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094600
      *----------------------------------------------------             00094700
       1000-99-FIM.                                  EXIT.              00094800
      *----------------------------------------------------             00094900
                                                                        00095000
      *----------------------------------------------------             00095100
       2000-PROCESSAR                             SECTION.              00095200
      *----------------------------------------------------             00095300
           DISPLAY 'WRK-DADOS:      '   WRK-DADOS.                      00095400
           DISPLAY 'ENDERECO:       '   WRK-ENDERECOCOMP.               00095500
           DISPLAY 'BAIRRO:         '   WRK-BAIRRO-1.                   00095600
      *----------------------------------------------------             00095700
       2000-99-FIM.                                  EXIT.              00095800
      *----------------------------------------------------             00095900
                                                                        00096000
      *----------------------------------------------------             00096100
       3000-FINALIZAR                             SECTION.              00096200
      *----------------------------------------------------             00096300
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
