      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB08.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO ADD COM DUAS VARIAVEIS         *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-N1      PIC 9(02)V99 VALUE ZEROS.                      00091600
          05 WRK-N2      PIC 9(02)V99 VALUE ZEROS.                      00091700
                                                                        00091800
      *----------------------------------------------------             00091900
       01 FILLER PIC X(48) VALUE                                        00092000
           '--------------VARIAVEIS PARA ACUMULAR--------'.             00092100
      *----------------------------------------------------             00092200
       77 WRK-N3         PIC 9(03)V99 VALUE ZEROS.                      00092300
       77 WRK-N3-ED      PIC ZZ9,99.                                    00092400
      *====================================================             00092500
       PROCEDURE                                 DIVISION.              00092600
      *====================================================             00092700
      *----------------------------------------------------             00092800
       0000-PRINCIPAL                             SECTION.              00092900
      *----------------------------------------------------             00093000
           PERFORM 1000-INICIALIZAR.                                    00093100
           PERFORM 2000-PROCESSAR.                                      00093200
           PERFORM 3000-FINALIZAR.                                      00093300
           STOP RUN.                                                    00093400
      *----------------------------------------------------             00093500
       0000-99-FIM.                                  EXIT.              00093600
      *----------------------------------------------------             00093700
                                                                        00093800
      *----------------------------------------------------             00093900
       1000-INICIALIZAR                           SECTION.              00094000
      *----------------------------------------------------             00094100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094200
      *----------------------------------------------------             00094300
       1000-99-FIM.                                  EXIT.              00094400
      *----------------------------------------------------             00094500
                                                                        00094600
      *----------------------------------------------------             00094700
       2000-PROCESSAR                             SECTION.              00094800
      *----------------------------------------------------             00094900
           DISPLAY 'WRK-N1:    '   WRK-N1.                              00095000
           DISPLAY 'WRK-N2:    '   WRK-N2.                              00095100
            ADD WRK-N1 WRK-N2 TO WRK-N3.                                00095200
           DISPLAY 'WRK-N3:    '   WRK-N3.                              00095300
            MOVE WRK-N3 TO WRK-N3-ED.                                   00095400
           DISPLAY 'WRK-N3-ED: '   WRK-N3-ED.                           00095500
      *----------------------------------------------------             00095600
       2000-99-FIM.                                  EXIT.              00095700
      *----------------------------------------------------             00095800
                                                                        00095900
      *----------------------------------------------------             00096000
       3000-FINALIZAR                             SECTION.              00096100
      *----------------------------------------------------             00096200
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
