      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB22.                                            00040000
                                                                        00050000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: COMANDO DE REPETICAO PERFORM TIMES      *             00081000
      *===================================================*             00083000
                                                                        00084000
      *====================================================             00085000
       ENVIRONMENT                               DIVISION.              00086000
      *====================================================             00087000
       CONFIGURATION                              SECTION.              00088000
       SPECIAL-NAMES.                                                   00089000
           DECIMAL-POINT IS COMMA.                                      00090000
                                                                        00090100
      *====================================================             00090200
       DATA                                      DIVISION.              00090300
      *====================================================             00090400
      *----------------------------------------------------             00090500
       WORKING-STORAGE                            SECTION.              00090600
      *----------------------------------------------------             00090700
       01 WRK-DADOS.                                                    00091100
          05 WRK-NUMERO      PIC 9(02)    VALUE ZEROS.                  00091200
       77 WRK-COUNT          PIC 9(02)    VALUE 10.                     00091300
       77 WRK-TOTAL          PIC 9(02)    VALUE ZEROS.                  00091400
      *====================================================             00091600
       PROCEDURE                                 DIVISION.              00091700
      *====================================================             00091800
      *----------------------------------------------------             00091900
       0000-PRINCIPAL                             SECTION.              00092000
      *----------------------------------------------------             00092100
           PERFORM 1000-INICIALIZAR.                                    00092200
           PERFORM 2000-PROCESSAR 10 TIMES.                             00092300
           PERFORM 3000-FINALIZAR.                                      00092400
           STOP RUN.                                                    00092500
      *----------------------------------------------------             00092600
       0000-99-FIM.                                EXIT.                00092700
      *----------------------------------------------------             00092800
                                                                        00092900
      *----------------------------------------------------             00093000
       1000-INICIALIZAR                           SECTION.              00093100
      *----------------------------------------------------             00093200
           ACCEPT WRK-DADOS FROM SYSIN.                                 00093300
      *----------------------------------------------------             00093400
       1000-99-FIM.                                EXIT.                00093500
      *----------------------------------------------------             00093600
                                                                        00093700
      *----------------------------------------------------             00093800
       2000-PROCESSAR                             SECTION.              00093900
      *----------------------------------------------------             00094000
           COMPUTE WRK-TOTAL = WRK-NUMERO * WRK-COUNT                   00094100
           DISPLAY WRK-NUMERO '*' WRK-COUNT '=' WRK-TOTAL.              00094300
            SUBTRACT 1 FROM WRK-COUNT.                                  00094400
      *----------------------------------------------------             00095500
       2000-99-FIM.                                EXIT.                00095600
      *----------------------------------------------------             00095700
                                                                        00095800
      *----------------------------------------------------             00095900
       3000-FINALIZAR                             SECTION.              00096000
      *----------------------------------------------------             00097000
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00097100
      *----------------------------------------------------             00097200
       3000-99-FIM.                                EXIT.                00097300
      *----------------------------------------------------             00097400
                                                                        00097500
      *----------------------------------------------------             00097600
       9000-TRATA-ERROS                            SECTION.             00097700
      *----------------------------------------------------             00097800
      *----------------------------------------------------             00097900
       9000-99-FIM.                                EXIT.                00098000
      *----------------------------------------------------             00099000
