      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB12.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO SUBTRACT                       *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                               SECTION.             00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *===================================================              00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-PRODUTO      PIC  X(30)     VALUE SPACES.              00091600
          05 WRK-VALOR        PIC S9(05)V99  VALUE ZEROS.               00091700
          05 WRK-DESCONTO     PIC S9(03)V99  VALUE ZEROS.               00091800
                                                                        00091900
      *----------------------------------------------------             00092000
       01 FILLER PIC X(48) VALUE                                        00092100
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092200
      *----------------------------------------------------             00092300
       77 WRK-RES             PIC S9(05)V99  VALUE 0.                   00092400
       77 WRK-RES-EDIT        PIC -ZZ.ZZ9,99.                           00092500
      *====================================================             00092600
       PROCEDURE                                 DIVISION.              00092700
      *====================================================             00092800
      *----------------------------------------------------             00092900
       0000-PRINCIPAL                             SECTION.              00093000
      *----------------------------------------------------             00093100
           PERFORM 1000-INICIALIZAR.                                    00093200
           PERFORM 2000-PROCESSAR.                                      00093300
           PERFORM 3000-FINALIZAR.                                      00093400
           STOP RUN.                                                    00093500
      *----------------------------------------------------             00093600
       0000-99-FIM.                                  EXIT.              00093700
      *----------------------------------------------------             00093800
                                                                        00093900
      *----------------------------------------------------             00094000
       1000-INICIALIZAR                           SECTION.              00094100
      *----------------------------------------------------             00094200
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094300
      *----------------------------------------------------             00094400
       1000-99-FIM.                                  EXIT.              00094500
      *----------------------------------------------------             00094600
                                                                        00094700
      *----------------------------------------------------             00094800
       2000-PROCESSAR                             SECTION.              00094900
      *----------------------------------------------------             00095000
           DISPLAY 'WRK-PRODUTO:           '  WRK-PRODUTO.              00095100
           DISPLAY 'WRK-VALOR BRUTO:       '  WRK-VALOR.                00095200
           DISPLAY 'WRK-DESCONTO:          '  WRK-DESCONTO.             00095300
            SUBTRACT WRK-DESCONTO FROM WRK-VALOR                        00095400
                     GIVING WRK-RES.                                    00095500
            MOVE WRK-RES TO WRK-RES-EDIT.                               00095600
           DISPLAY 'WRK-VALOR COM DESCONTO:'  WRK-RES-EDIT.             00095700
      *----------------------------------------------------             00095800
       2000-99-FIM.                                  EXIT.              00095900
      *----------------------------------------------------             00096000
                                                                        00096100
      *----------------------------------------------------             00096200
       3000-FINALIZAR                             SECTION.              00096300
      *----------------------------------------------------             00096400
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
