      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB09.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO ADD 3 VARIAVEIS.               *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-N1      PIC 9(02)V99 VALUE ZEROS.                      00091600
          05 WRK-N2      PIC 9(02)V99 VALUE ZEROS.                      00091700
                                                                        00091800
      *----------------------------------------------------             00091900
       01 FILLER PIC X(48) VALUE                                        00092000
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092100
      *----------------------------------------------------             00092300
       77 WRK-N3         PIC 9(03)V99 VALUE 1.                          00092400
       77 WRK-N3-ED      PIC ZZ9,99.                                    00092500
      *====================================================             00092600
       PROCEDURE                                 DIVISION.              00092700
      *====================================================             00092800
      *----------------------------------------------------             00092900
       0000-PRINCIPAL                             SECTION.              00093000
      *----------------------------------------------------             00093100
           PERFORM 1000-INICIALIZAR.                                    00093200
           PERFORM 2000-PROCESSAR.                                      00093300
           PERFORM 3000-FINALIZAR.                                      00093400
           STOP RUN.                                                    00093500
      *----------------------------------------------------             00093600
       0000-99-FIM.                                  EXIT.              00093700
      *----------------------------------------------------             00093800
                                                                        00093900
      *----------------------------------------------------             00094000
       1000-INICIALIZAR                           SECTION.              00094100
      *----------------------------------------------------             00094200
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094300
      *----------------------------------------------------             00094400
       1000-99-FIM.                                  EXIT.              00094500
      *----------------------------------------------------             00094600
                                                                        00094700
      *----------------------------------------------------             00094800
       2000-PROCESSAR                             SECTION.              00094900
      *----------------------------------------------------             00095000
           DISPLAY 'WRK-N1:    '   WRK-N1.                              00095100
           DISPLAY 'WRK-N2:    '   WRK-N2.                              00095200
            ADD WRK-N1 WRK-N2 TO WRK-N3.                                00095300
           DISPLAY 'WRK-N3:    '   WRK-N3.                              00095400
            MOVE WRK-N3 TO WRK-N3-ED.                                   00095500
           DISPLAY 'WRK-N3-ED: '   WRK-N3-ED.                           00095600
      *----------------------------------------------------             00095700
       2000-99-FIM.                                  EXIT.              00095800
      *----------------------------------------------------             00095900
                                                                        00096000
      *----------------------------------------------------             00096100
       3000-FINALIZAR                             SECTION.              00096200
      *----------------------------------------------------             00096300
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
