      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB17.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: IFELSE,  MEDIA ALCOOL/GASOLINA          *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-GASOLINA    PIC 9(02)V99    VALUE ZEROS.               00091600
          05 WRK-ALCOOL      PIC 9(02)V99    VALUE ZEROS.               00091700
                                                                        00091800
      *----------------------------------------------------             00091900
       01 FILLER PIC X(48) VALUE                                        00092000
           '--------------VARIAVEIS CALCULAR/MASCARA-----'.             00092100
      *----------------------------------------------------             00092200
       77 WRK-MEDIA          PIC 9(02)V99    VALUE ZEROS.               00092300
       77 WRK-MEDIA-ED       PIC Z9,99.                                 00092500
      *====================================================             00092600
       PROCEDURE                                 DIVISION.              00092700
      *====================================================             00092800
      *----------------------------------------------------             00092900
       0000-PRINCIPAL                             SECTION.              00093000
      *----------------------------------------------------             00093100
           PERFORM 1000-INICIALIZAR.                                    00093200
           PERFORM 2000-PROCESSAR.                                      00093300
           PERFORM 3000-FINALIZAR.                                      00093400
           STOP RUN.                                                    00093500
      *----------------------------------------------------             00093600
       0000-99-FIM.                                  EXIT.              00093700
      *----------------------------------------------------             00093800
                                                                        00094000
      *----------------------------------------------------             00094100
       1000-INICIALIZAR                           SECTION.              00094200
      *----------------------------------------------------             00094300
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094400
      *----------------------------------------------------             00094500
       1000-99-FIM.                                  EXIT.              00094600
      *----------------------------------------------------             00094700
                                                                        00094800
      *----------------------------------------------------             00094900
       2000-PROCESSAR                             SECTION.              00095000
      *----------------------------------------------------             00095100
           DISPLAY 'WRK-GASOLINA: '  WRK-GASOLINA.                      00095200
           DISPLAY 'WRK-ALCOOL:   '  WRK-ALCOOL.                        00095300
             COMPUTE WRK-MEDIA = WRK-ALCOOL / WRK-GASOLINA.             00095400
             MOVE WRK-MEDIA TO WRK-MEDIA-ED.                            00095500
                                                                        00095600
           IF WRK-GASOLINA IS NUMERIC AND WRK-ALCOOL IS NUMERIC         00095700
              IF WRK-MEDIA LESS THAN OR EQUAL 0,70                      00095800
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00095900
                 DISPLAY 'ABASTECA COM ALCOOL'                          00096000
              ELSE                                                      00096100
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00096200
                 DISPLAY 'ABASTECA COM GASOLINA'                        00096300
              END-IF                                                    00096400
           ELSE                                                         00096500
                 DISPLAY 'O VALOR FORNECIDO NAO E UM NUMERO'            00096600
           END-IF.                                                      00096700
      *----------------------------------------------------             00096800
       2000-99-FIM.                                  EXIT.              00096900
      *----------------------------------------------------             00097000
                                                                        00097100
      *----------------------------------------------------             00097200
       3000-FINALIZAR                             SECTION.              00097300
      *----------------------------------------------------             00097400
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00098000
      *----------------------------------------------------             00099000
       3000-99-FIM.                                  EXIT.              00100000
      *----------------------------------------------------             00110000
