      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22LVSA.                                            00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: ABRIR E LER REGISTRO DE ARQUIVO VSAM.  *             00080007
      *---------------------------------------------------*             00080100
      *  ARQUIVOS:                                        *             00080200
      *  DDNAME             I/O           INCLUDE/BOOK    *             00080300
      *  ARQVSAM             I             ---------      *             00080401
      *===================================================*             00081000
                                                                        00082000
      *====================================================             00083000
       ENVIRONMENT                               DIVISION.              00084000
      *====================================================             00085000
       CONFIGURATION                             SECTION.               00086000
       SPECIAL-NAMES.                                                   00087000
           DECIMAL-POINT  IS COMMA.                                     00088000
                                                                        00089000
       INPUT-OUTPUT                              SECTION.               00090000
       FILE-CONTROL.                                                    00100000
           SELECT ARQVSAM ASSIGN TO ARQVSAM                             00110001
               ORGANIZATION IS INDEXED                                  00120001
               ACCESS MODE  IS DYNAMIC                                  00121001
               RECORD KEY   IS ARQ-CHAVE                                00122001
               FILE STATUS  IS WRK-FS-ARQVSAM.                          00123003
                                                                        00124002
      *====================================================             00130400
       DATA                                      DIVISION.              00130500
      *====================================================             00130600
      *----------------------------------------------------             00130702
       FILE                                      SECTION.               00130800
      *----------------------------------------------------             00130902
       FD ARQVSAM.                                                      00131002
       01 REG-ARQVSAM.                                                  00133302
          05 ARQ-CHAVE       PIC X(05).                                 00133402
          05 ARQ-NOME        PIC X(30).                                 00133502
          05 ARQ-SETOR       PIC X(04).                                 00133602
          05 ARQ-SALARIO     PIC 9(08)V99.                              00133712
          05 ARQ-DATAADM     PIC X(10).                                 00133802
          05 ARQ-EMAIL       PIC X(40).                                 00133902
                                                                        00134000
      *----------------------------------------------------             00137102
       WORKING-STORAGE                           SECTION.               00137200
      *----------------------------------------------------             00137302
           COPY '#GLOG'.                                                00137400
      *----------------------------------------------------             00137502
       01 FILLER PIC X(48) VALUE                                        00137602
           '--------------AREA FILE STATUS---------------'.             00137710
      *----------------------------------------------------             00137802
       77 WRK-FS-ARQVSAM     PIC 9(02).                                 00138002
      *----------------------------------------------------             00138110
       01 FILLER PIC X(48) VALUE                                        00138210
           '--------------AREA MASCARAS------------------'.             00138310
      *----------------------------------------------------             00138510
       77 WRK-SALARIO-ED     PIC Z.ZZZ.ZZZ9,99.                         00138610
                                                                        00138710
      *====================================================             00138800
       PROCEDURE                                 DIVISION.              00138900
      *====================================================             00139000
      *----------------------------------------------------             00139102
       0000-PRINCIPAL                             SECTION.              00139200
      *-----------------------------------------------------            00139300
           PERFORM 1000-INICIALIZAR.                                    00139400
           PERFORM 2000-PROCESSAR.                                      00139502
           PERFORM 3000-FINALIZAR.                                      00139700
           STOP RUN.                                                    00139800
      *-----------------------------------------------------            00139900
       0000-99-FIM.                                  EXIT.              00140000
      *-----------------------------------------------------            00140100
                                                                        00140200
      *-----------------------------------------------------            00140300
       1000-INICIALIZAR                           SECTION.              00140400
      *-----------------------------------------------------            00140500
           OPEN INPUT ARQVSAM.                                          00140602
             PERFORM 4000-TESTAR-STATUS.                                00140800
           ACCEPT ARQ-CHAVE FROM SYSIN.                                 00140902
           READ ARQVSAM.                                                00141002
      *-----------------------------------------------------            00144000
       1000-99-FIM.                                  EXIT.              00145000
      *-----------------------------------------------------            00146000
                                                                        00147000
      *-----------------------------------------------------            00148000
       2000-PROCESSAR                             SECTION.              00149000
      *-----------------------------------------------------            00150000
           IF WRK-FS-ARQVSAM NOT EQUAL ZEROS                            00150104
            DISPLAY 'REGISTRO NAO ENCONTRADO'                           00150202
            DISPLAY 'CODIGO VSAM' WRK-FS-ARQVSAM                        00150302
           ELSE                                                         00150402
            DISPLAY 'CHAVE..:'    ARQ-CHAVE                             00150707
            DISPLAY 'NOME...:'    ARQ-NOME                              00150807
            DISPLAY 'SETOR..:'    ARQ-SETOR                             00150907
             MOVE ARQ-SALARIO TO WRK-SALARIO-ED                         00151010
            DISPLAY 'SALARIO:'    WRK-SALARIO-ED                        00151110
            DISPLAY 'DATAADM:'    ARQ-DATAADM                           00152007
            DISPLAY 'EMAIL..:'    ARQ-EMAIL                             00153007
           END-IF.                                                      00156000
      *-----------------------------------------------------            00158000
       2000-99-FIM.                                  EXIT.              00159000
      *-----------------------------------------------------            00160000
                                                                        00160100
      *-----------------------------------------------------            00160200
       3000-FINALIZAR                             SECTION.              00160300
      *-----------------------------------------------------            00160400
           CLOSE ARQVSAM.                                               00160502
           DISPLAY 'FIM DE PROCESSAMENTO'.                              00160613
      *-----------------------------------------------------            00160700
       3000-99-FIM.                                  EXIT.              00160800
      *-----------------------------------------------------            00160900
                                                                        00161000
      *-----------------------------------------------------            00161100
       4000-TESTAR-STATUS                         SECTION.              00162000
      *-----------------------------------------------------            00163002
           IF WRK-FS-ARQVSAM NOT EQUAL 0                                00164002
             MOVE 'FR22LVSA'             TO WRK-PROGRAMA                00164102
             MOVE '4000'                 TO WRK-SECAO                   00164202
             MOVE 'ERRO NO OPEN ARQVSAM' TO WRK-MENSAGEM                00164302
             MOVE WRK-FS-ARQVSAM         TO WRK-STATUS                  00164402
             PERFORM 9000-ERRO                                          00164502
           END-IF.                                                      00164600
      *-----------------------------------------------------            00164700
       4000-99-FIM.                                  EXIT.              00164802
      *-----------------------------------------------------            00164900
                                                                        00165002
      *-----------------------------------------------------            00166500
       9000-ERRO                                  SECTION.              00166600
      *-----------------------------------------------------            00166700
           DISPLAY 'FIM DE PROCESSAMENTO'.                              00166813
           CALL 'GRAVALOG' USING WRK-DADOS.                             00166913
           GOBACK.                                                      00167000
      *-----------------------------------------------------            00167100
       9000-99-FIM.                                  EXIT.              00167200
      *-----------------------------------------------------            00167300
