      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22EX02.                                            00040000
      *===================================================*             00050000
      * AUTOR   : VICTOR LEAL                             *             00060000
      * EMPRESA : FOURSYS                                 *             00070000
      * OBJETIVO: PROGRAMA TEM A FINALIDADE DE RECEBER    *             00080000
      *           DADOS DOS ARQUIVOS DE ENTRADA FUNC E    *             00080100
      *           MOVPROJ, FAZER A RELACAO (BALANCO) ENTRE*             00080200
      *           AS CHAVES E GRAVAR NO ARQUIVO DE SAIDA  *             00080300
      *           FUNPROJ3.                               *             00080400
      *---------------------------------------------------*             00080500
      *  ARQUIVOS:                                        *             00080600
      *  DDNAME             I/O           INCLUDE/BOOK    *             00080700
      *  FUNC                I             ---------      *             00080800
      *  MOVPROJ             I             ---------      *             00080900
      *  FUNPROJ3            O             ---------      *             00081000
      *===================================================*             00081100
                                                                        00081200
      *====================================================             00081300
       ENVIRONMENT                               DIVISION.              00081400
      *====================================================             00081500
       CONFIGURATION                             SECTION.               00081600
       SPECIAL-NAMES.                                                   00081700
           DECIMAL-POINT  IS COMMA.                                     00081800
                                                                        00081900
       INPUT-OUTPUT                              SECTION.               00082000
       FILE-CONTROL.                                                    00082100
           SELECT FUNC ASSIGN TO FUNC                                   00082200
               FILE STATUS IS WRK-FS-FUNC.                              00082300
                                                                        00082400
           SELECT MOVPROJ ASSIGN TO MOVPROJ                             00082500
               FILE STATUS IS WRK-FS-MOVPROJ.                           00082600
                                                                        00082700
           SELECT FUNPROJ3 ASSIGN TO FUNPROJ3                           00082800
               FILE STATUS IS WRK-FS-FUNPROJ3.                          00082900
                                                                        00083000
      *====================================================             00083100
       DATA                                      DIVISION.              00083200
      *====================================================             00083300
      *-----------------------------------------------------            00083400
       FILE                                      SECTION.               00083500
      *-----------------------------------------------------            00083600
       FD FUNC                                                          00083700
           RECORDING MODE IS F                                          00083800
           BLOCK CONTAINS 0 RECORDS.                                    00083900
      *-----------LRECL 39-----------------------------------           00084000
       01 FD-FUNC.                                                      00084100
          05 FD-FUNC-IDFUNC     PIC X(05).                              00084200
          05 FD-FUNC-NOMEFUNC   PIC X(30).                              00085000
          05 FD-FUNC-SETORFUNC  PIC X(04).                              00086000
                                                                        00087000
       FD MOVPROJ                                                       00087100
           RECORDING MODE IS F                                          00087200
           BLOCK CONTAINS 0 RECORDS.                                    00087300
      *-----------LRECL 28----------------------------------            00087400
       01 FD-MOVPROJ.                                                   00087500
          05 FD-MOVPROJ-IDFUNC     PIC X(05).                           00087600
          05 FD-MOVPROJ-PROJETO    PIC X(20).                           00087700
          05 FD-MOVPROJ-QTHORAS    PIC 9(03).                           00087800
                                                                        00088000
       FD FUNPROJ3                                                      00089000
           RECORDING MODE IS F                                          00090000
           BLOCK CONTAINS 0 RECORDS.                                    00100000
      *-----------LRECL 58----------------------------------            00101000
       01 FD-FUNPROJ3.                                                  00110000
          05 FD-IDFUNC     PIC X(05).                                   00111000
          05 FD-NOMEFUNC   PIC X(30).                                   00120000
          05 FD-PROJETO    PIC X(20).                                   00121000
          05 FD-QTHORAS    PIC 9(03).                                   00122000
                                                                        00123000
      *-----------------------------------------------------            00130000
       WORKING-STORAGE                           SECTION.               00130100
      *-----------------------------------------------------            00130200
           COPY '#GLOG'.                                                00130300
      *-----------------------------------------------------            00137200
       01 FILLER PIC X(48) VALUE                                        00137300
            '-------VARIAVEIS PARA FILE STATUS------------'.            00137400
      *-----------------------------------------------------            00137500
       77 WRK-FS-FUNC          PIC 9(02).                               00137600
       77 WRK-FS-MOVPROJ       PIC 9(02).                               00137700
       77 WRK-FS-FUNPROJ3      PIC 9(02).                               00137800
      *-----------------------------------------------------            00137900
       01 FILLER PIC X(48) VALUE                                        00138000
            '-------VARIAVEIS PARA MENSAGEM---------------'.            00138100
      *-----------------------------------------------------            00138200
       77 WRK-MENSAGEM-FIM     PIC X(16) VALUE                          00138300
           'FIM DO ARQUIVO.'.                                           00138400
      *====================================================             00138600
       PROCEDURE                                 DIVISION.              00138700
      *====================================================             00138800
      *-----------------------------------------------------            00138900
       0000-PRINCIPAL                             SECTION.              00139000
      *-----------------------------------------------------            00139100
           PERFORM 1000-INICIALIZAR.                                    00139200
            PERFORM 1100-VERIFICA-VAZIO.                                00139300
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-FUNC EQUAL 10            00139400
                                AND WRK-FS-MOVPROJ EQUAL 10.            00139500
           PERFORM 3000-FINALIZAR.                                      00139600
           STOP RUN.                                                    00139700
      *-----------------------------------------------------            00139800
       0000-99-FIM.                                  EXIT.              00139900
      *-----------------------------------------------------            00140000
                                                                        00140100
      *-----------------------------------------------------            00140200
       1000-INICIALIZAR                           SECTION.              00140300
      *-----------------------------------------------------            00140400
           OPEN INPUT FUNC MOVPROJ                                      00140500
                OUTPUT FUNPROJ3.                                        00140600
             PERFORM 4000-TESTAR-STATUS.                                00140700
      *-----------------------------------------------------            00140800
       1000-99-FIM.                                  EXIT.              00140900
      *-----------------------------------------------------            00141000
                                                                        00142400
      *-----------------------------------------------------            00142500
       1100-VERIFICA-VAZIO                       SECTION.               00142600
      *-----------------------------------------------------            00142700
           READ FUNC.                                                   00142800
           READ MOVPROJ.                                                00142900
      *-----------------------------------------------------            00143700
       1100-99-FIM.                                  EXIT.              00143800
      *-----------------------------------------------------            00143900
                                                                        00144000
      *-----------------------------------------------------            00144100
       2000-PROCESSAR                             SECTION.              00144200
      *-----------------------------------------------------            00144300
           EVALUATE TRUE                                                00144400
            WHEN FD-FUNC-IDFUNC LESS FD-MOVPROJ-IDFUNC                  00144500
              READ FUNC                                                 00144600
            WHEN FD-FUNC-IDFUNC EQUAL FD-MOVPROJ-IDFUNC                 00144700
              MOVE FD-FUNC-IDFUNC     TO FD-IDFUNC                      00144800
              MOVE FD-FUNC-NOMEFUNC   TO FD-NOMEFUNC                    00144900
              MOVE FD-MOVPROJ-PROJETO TO FD-PROJETO                     00145000
              MOVE FD-MOVPROJ-QTHORAS TO FD-QTHORAS                     00146000
                WRITE FD-FUNPROJ3                                       00147000
                 READ MOVPROJ                                           00147100
                   IF WRK-FS-MOVPROJ EQUAL 10                           00147200
                     MOVE HIGH-VALUES TO FD-MOVPROJ-IDFUNC              00147300
                   END-IF                                               00147400
            WHEN OTHER                                                  00147500
             DISPLAY 'CHAVE NAO BATE' FD-FUNC-IDFUNC                    00147600
            END-EVALUATE.                                               00147700
      *-----------------------------------------------------            00147800
       2000-99-FIM.                                  EXIT.              00147900
      *-----------------------------------------------------            00148000
                                                                        00148100
      *-----------------------------------------------------            00148200
       3000-FINALIZAR                             SECTION.              00148300
      *-----------------------------------------------------            00148400
           CLOSE FUNC MOVPROJ                                           00148500
                 FUNPROJ3.                                              00148600
           DISPLAY WRK-MENSAGEM-FIM.                                    00148800
      *-----------------------------------------------------            00150000
       3000-99-FIM.                                  EXIT.              00151000
      *-----------------------------------------------------            00151100
                                                                        00151200
      *-----------------------------------------------------            00151300
       4000-TESTAR-STATUS                         SECTION.              00151400
      *-----------------------------------------------------            00151500
           PERFORM 4100-TESTARSTATUS-FUNC.                              00151600
           PERFORM 4200-TESTARSTATUS-MOVPROJ.                           00151700
           PERFORM 4300-TESTARSTATUS-FUNPROJ3.                          00151800
      *-----------------------------------------------------            00155000
       4000-99-FIM.                                  EXIT.              00156000
      *-----------------------------------------------------            00157000
                                                                        00158000
      *-----------------------------------------------------            00158100
       4100-TESTARSTATUS-FUNC                     SECTION.              00158200
      *-----------------------------------------------------            00158300
           IF WRK-FS-FUNC NOT EQUAL 00                                  00158400
            MOVE 'BALANCE'           TO WRK-PROGRAMA                    00158500
            MOVE 'ERRO NO OPEN FUNC' TO WRK-MENSAGEM                    00158600
            MOVE '1000'              TO WRK-SECAO                       00158700
            MOVE WRK-FS-FUNC         TO WRK-STATUS                      00158800
            PERFORM 9000-TRATAERROS                                     00158900
           END-IF.                                                      00159000
      *-----------------------------------------------------            00159100
       4100-99-FIM.                                  EXIT.              00159200
      *-----------------------------------------------------            00159300
                                                                        00159400
      *-----------------------------------------------------            00159500
       4200-TESTARSTATUS-MOVPROJ                  SECTION.              00159600
      *-----------------------------------------------------            00159700
           IF WRK-FS-MOVPROJ NOT EQUAL 00                               00159800
             MOVE 'BALANCE'               TO WRK-PROGRAMA               00159900
             MOVE 'ERRO NO OPEN MOVPROJ'  TO WRK-MENSAGEM               00160000
             MOVE '1000'                  TO WRK-SECAO                  00160100
             MOVE WRK-FS-MOVPROJ          TO WRK-STATUS                 00160200
             PERFORM 9000-TRATAERROS                                    00160300
            END-IF.                                                     00160400
      *-----------------------------------------------------            00160500
       4200-99-FIM.                                  EXIT.              00160600
      *-----------------------------------------------------            00160700
                                                                        00160800
      *-----------------------------------------------------            00160900
       4300-TESTARSTATUS-FUNPROJ3                 SECTION.              00161000
      *-----------------------------------------------------            00161100
           IF WRK-FS-FUNPROJ3 NOT EQUAL 00                              00161200
            MOVE 'BALANCE'               TO WRK-PROGRAMA                00161300
            MOVE 'ERRO NO OPEN FUNPROJ3' TO WRK-MENSAGEM                00161400
            MOVE '1000'                  TO WRK-SECAO                   00161500
            MOVE WRK-FS-FUNPROJ3         TO WRK-STATUS                  00161600
            PERFORM 9000-TRATAERROS                                     00161700
           END-IF.                                                      00161800
      *-----------------------------------------------------            00161900
       4300-99-FIM.                                  EXIT.              00162000
      *-----------------------------------------------------            00162100
                                                                        00162200
      *-----------------------------------------------------            00162300
       9000-TRATAERROS                            SECTION.              00162400
      *-----------------------------------------------------            00162500
            CALL 'GRAVALOG' USING WRK-DADOS.                            00162700
           GOBACK.                                                      00162800
      *-----------------------------------------------------            00162900
       9000-99-FIM.                                  EXIT.              00163000
      *-----------------------------------------------------            00164000
