      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22EX03.                                            00040000
      *===================================================*             00050000
      * AUTOR   : VICTOR LEAL                             *             00060000
      * EMPRESA : FOURSYS                                 *             00070000
      * OBJETIVO: PROGRAMA TEM A FINALIDADE DE RECEBER    *             00080000
      *           DADOS DOS ARQUIVOS DE ENTRADA CLIENTES E*             00080100
      *           MOV3105, FAZER A RELACAO(BALANCO) ENTRE *             00080200
      *           AS CHAVES E GRAVAR NO ARQUIVO DE SAIDA  *             00080300
      *           CLI3105.                                *             00080400
      *---------------------------------------------------*             00080500
      *  ARQUIVOS:                                        *             00080600
      *  DDNAME             I/O           INCLUDE/BOOK    *             00080700
      *  CLIENTES            I             ---------      *             00080800
      *  MOV3105             I             ---------      *             00080900
      *  CLI3105             O             ---------      *             00081000
      *===================================================*             00081100
                                                                        00081200
      *====================================================             00081300
       ENVIRONMENT                               DIVISION.              00081400
      *====================================================             00081500
       CONFIGURATION                             SECTION.               00081600
       SPECIAL-NAMES.                                                   00081700
           DECIMAL-POINT  IS COMMA.                                     00081800
                                                                        00081900
       INPUT-OUTPUT                              SECTION.               00082000
       FILE-CONTROL.                                                    00082100
           SELECT CLIENTES ASSIGN TO CLIENTES                           00082200
               FILE STATUS IS WRK-FS-CLIENTES.                          00082300
                                                                        00082400
           SELECT MOV3105 ASSIGN TO MOV3105                             00082500
               FILE STATUS IS WRK-FS-MOV3105.                           00082600
                                                                        00082700
           SELECT CLI3105 ASSIGN TO CLI3105                             00082800
               FILE STATUS IS WRK-FS-CLI3105.                           00082900
                                                                        00083000
      *====================================================             00083100
       DATA                                      DIVISION.              00083200
      *====================================================             00083300
      *-----------------------------------------------------            00083400
       FILE                                      SECTION.               00083500
      *-----------------------------------------------------            00083600
       FD CLIENTES                                                      00083700
           RECORDING MODE IS F                                          00083800
           BLOCK CONTAINS 0 RECORDS.                                    00083900
      *-----------LRECL 46-----------------------------------           00084000
       01 FD-CLIENTES.                                                  00084100
          05 FD-CLIENTES-CHAVE.                                         00084200
             10 FD-CLIENTES-AGENCIA PIC X(04).                          00084300
             10 FD-CLIENTES-CONTA   PIC X(04).                          00084400
          05 FD-CLIENTES-NOME       PIC X(30).                          00084500
          05 FD-CLIENTES-SALDO      PIC 9(08).                          00084600
                                                                        00084700
       FD MOV3105                                                       00084800
           RECORDING MODE IS F                                          00085000
           BLOCK CONTAINS 0 RECORDS.                                    00086000
      *-----------LRECL 47----------------------------------            00087000
       01 FD-MOV3105.                                                   00087100
          05 FD-MOV3105-CHAVE.                                          00087200
             10 FD-MOV3105-AGENCIA PIC X(04).                           00087300
             10 FD-MOV3105-CONTA   PIC X(04).                           00087400
          05 FD-MOV3105-MOVIMENTO  PIC X(30).                           00087500
          05 FD-MOV3105-VALORMOV   PIC 9(08).                           00087600
          05 FD-MOV3105-TIPOMOV    PIC X(01).                           00087700
                                                                        00087800
       FD CLI3105                                                       00087900
           RECORDING MODE IS F                                          00088000
           BLOCK CONTAINS 0 RECORDS.                                    00088100
      *-----------LRECL 46----------------------------------            00088200
       01 FD-CLI3105.                                                   00088300
          05 FD-CHAVE.                                                  00088400
             10 FD-AGENCIA         PIC X(04).                           00088500
             10 FD-CONTA           PIC X(04).                           00088600
          05 FD-NOME               PIC X(30).                           00089000
          05 FD-SALDO              PIC 9(08).                           00090000
                                                                        00120000
      *-----------------------------------------------------            00130000
       WORKING-STORAGE                           SECTION.               00130100
      *-----------------------------------------------------            00130200
           COPY '#GLOG'.                                                00130300
      *-----------------------------------------------------            00130400
       01 FILLER PIC X(48) VALUE                                        00130500
            '-------VARIAVEIS PARA FILE STATUS------------'.            00130600
      *-----------------------------------------------------            00130700
       77 WRK-FS-CLIENTES     PIC 9(02).                                00130800
       77 WRK-FS-MOV3105      PIC 9(02).                                00130900
       77 WRK-FS-CLI3105      PIC 9(02).                                00131000
      *-----------------------------------------------------            00132000
       01 FILLER PIC X(48) VALUE                                        00133000
            '-------VARIAVEIS PARA MENSAGEM---------------'.            00134000
      *-----------------------------------------------------            00135000
       77 WRK-MENSAGEM-FIM     PIC X(16) VALUE                          00136000
           'FIM DO ARQUIVO.'.                                           00137000
      *====================================================             00138000
       PROCEDURE                                 DIVISION.              00138100
      *====================================================             00138200
      *-----------------------------------------------------            00138300
       0000-PRINCIPAL                             SECTION.              00138400
      *-----------------------------------------------------            00138500
           PERFORM 1000-INICIALIZAR.                                    00138600
            PERFORM 1100-VERIFICA-VAZIO.                                00138700
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-CLIENTES                 00138800
                       EQUAL 10 AND WRK-FS-MOV3105 EQUAL 10.            00138900
           PERFORM 3000-FINALIZAR.                                      00139000
           STOP RUN.                                                    00139100
      *-----------------------------------------------------            00139200
       0000-99-FIM.                                  EXIT.              00139300
      *-----------------------------------------------------            00139400
                                                                        00139500
      *-----------------------------------------------------            00139600
       1000-INICIALIZAR                           SECTION.              00139700
      *-----------------------------------------------------            00139800
           OPEN INPUT CLIENTES MOV3105                                  00139900
                OUTPUT CLI3105.                                         00140000
             PERFORM 4000-TESTAR-STATUS.                                00140100
      *-----------------------------------------------------            00140200
       1000-99-FIM.                                  EXIT.              00140300
      *-----------------------------------------------------            00140400
                                                                        00140500
      *-----------------------------------------------------            00140600
       1100-VERIFICA-VAZIO                       SECTION.               00140700
      *-----------------------------------------------------            00140800
           READ CLIENTES.                                               00140900
           READ MOV3105.                                                00141000
      *-----------------------------------------------------            00142000
       1100-99-FIM.                                  EXIT.              00143000
      *-----------------------------------------------------            00143100
                                                                        00143200
      *-----------------------------------------------------            00143300
       2000-PROCESSAR                             SECTION.              00143400
      *-----------------------------------------------------            00143500
           EVALUATE TRUE                                                00143600
            WHEN FD-CLIENTES-CHAVE LESS FD-MOV3105-CHAVE                00143700
             MOVE FD-CLIENTES-CHAVE  TO FD-CHAVE                        00143800
             MOVE FD-CLIENTES-NOME   TO FD-NOME                         00143900
             MOVE FD-CLIENTES-SALDO  TO FD-SALDO                        00144000
              WRITE FD-CLI3105                                          00144100
              READ CLIENTES                                             00144300
                                                                        00144500
            WHEN FD-CLIENTES-CHAVE EQUAL FD-MOV3105-CHAVE               00144800
             IF FD-MOV3105-TIPOMOV EQUAL 'C'                            00144900
              ADD FD-MOV3105-VALORMOV TO FD-CLIENTES-SALDO              00145000
             ELSE                                                       00145400
              IF FD-MOV3105-VALORMOV LESS THAN OR EQUAL                 00145500
                 FD-CLIENTES-SALDO                                      00145600
                SUBTRACT FD-MOV3105-VALORMOV FROM                       00145700
                 FD-CLIENTES-SALDO                                      00145800
              END-IF                                                    00145900
             END-IF                                                     00146000
              READ MOV3105                                              00146100
                                                                        00146700
              IF WRK-FS-MOV3105 EQUAL 10                                00146800
               MOVE HIGH-VALUES TO FD-MOV3105-CHAVE                     00146900
              END-IF                                                    00147000
            END-EVALUATE.                                               00147100
      *-----------------------------------------------------            00147400
       2000-99-FIM.                                  EXIT.              00147500
      *-----------------------------------------------------            00147600
                                                                        00147700
      *-----------------------------------------------------            00147800
       3000-FINALIZAR                             SECTION.              00147900
      *-----------------------------------------------------            00148000
           CLOSE CLIENTES MOV3105                                       00148100
                 CLI3105.                                               00148200
           DISPLAY WRK-MENSAGEM-FIM.                                    00148300
      *-----------------------------------------------------            00148400
       3000-99-FIM.                                  EXIT.              00149000
      *-----------------------------------------------------            00150000
                                                                        00151000
      *-----------------------------------------------------            00151100
       4000-TESTAR-STATUS                         SECTION.              00151200
      *-----------------------------------------------------            00151300
           PERFORM 4100-TESTARSTATUS-CLIENTES.                          00151400
           PERFORM 4200-TESTARSTATUS-MOV3105.                           00151500
           PERFORM 4300-TESTARSTATUS-CLI3105.                           00151600
      *-----------------------------------------------------            00151700
       4000-99-FIM.                                  EXIT.              00151800
      *-----------------------------------------------------            00151900
                                                                        00152000
      *-----------------------------------------------------            00153000
       4100-TESTARSTATUS-CLIENTES                 SECTION.              00154000
      *-----------------------------------------------------            00155000
           IF WRK-FS-CLIENTES NOT EQUAL 00                              00156000
            MOVE 'FR22EX03'              TO WRK-PROGRAMA                00157000
            MOVE 'ERRO NO OPEN CLIENTES' TO WRK-MENSAGEM                00158000
            MOVE '1000'                  TO WRK-SECAO                   00158100
            MOVE WRK-FS-CLIENTES         TO WRK-STATUS                  00158200
            PERFORM 9000-TRATAERROS                                     00158300
           END-IF.                                                      00158400
      *-----------------------------------------------------            00158500
       4100-99-FIM.                                  EXIT.              00158600
      *-----------------------------------------------------            00158700
                                                                        00158800
      *-----------------------------------------------------            00158900
       4200-TESTARSTATUS-MOV3105                  SECTION.              00159000
      *-----------------------------------------------------            00159100
           IF WRK-FS-MOV3105 NOT EQUAL 00                               00159200
             MOVE 'FR22EX03'              TO WRK-PROGRAMA               00159300
             MOVE 'ERRO NO OPEN MOV3105'  TO WRK-MENSAGEM               00159400
             MOVE '1000'                  TO WRK-SECAO                  00159500
             MOVE WRK-FS-MOV3105          TO WRK-STATUS                 00159600
             PERFORM 9000-TRATAERROS                                    00159700
            END-IF.                                                     00159800
      *-----------------------------------------------------            00159900
       4200-99-FIM.                                  EXIT.              00160000
      *-----------------------------------------------------            00160100
                                                                        00160200
      *-----------------------------------------------------            00160300
       4300-TESTARSTATUS-CLI3105                  SECTION.              00160400
      *-----------------------------------------------------            00160500
           IF WRK-FS-CLI3105  NOT EQUAL 00                              00160600
            MOVE 'FR22EX03'              TO WRK-PROGRAMA                00160700
            MOVE 'ERRO NO OPEN CLI3105'  TO WRK-MENSAGEM                00160800
            MOVE '1000'                  TO WRK-SECAO                   00160900
            MOVE WRK-FS-CLI3105          TO WRK-STATUS                  00161000
            PERFORM 9000-TRATAERROS                                     00161100
           END-IF.                                                      00161200
      *-----------------------------------------------------            00161300
       4300-99-FIM.                                  EXIT.              00161400
      *-----------------------------------------------------            00161500
                                                                        00161600
      *-----------------------------------------------------            00161700
       9000-TRATAERROS                            SECTION.              00161800
      *-----------------------------------------------------            00161900
            CALL 'GRAVALOG' USING WRK-DADOS.                            00162000
           GOBACK.                                                      00162100
      *-----------------------------------------------------            00162200
       9000-99-FIM.                                  EXIT.              00162300
      *-----------------------------------------------------            00162400
