      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB16.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: IFELSE MEDIA NOTAS                      *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-N1    PIC 9(02)V99    VALUE ZEROS.                     00091600
          05 WRK-N2    PIC 9(02)V99    VALUE ZEROS.                     00091700
                                                                        00091800
      *----------------------------------------------------             00091900
       01 FILLER PIC X(48) VALUE                                        00092000
           '--------------VARIAVEIS CALCULAR/MASCARA-----'.             00092100
      *----------------------------------------------------             00092200
       77 WRK-MEDIA    PIC 9(02)V99    VALUE ZEROS.                     00092300
       77 WRK-MEDIA-ED PIC Z9,99.                                       00092400
      *====================================================             00092500
       PROCEDURE                                 DIVISION.              00092600
      *====================================================             00092700
      *----------------------------------------------------             00092800
       0000-PRINCIPAL                             SECTION.              00092900
      *----------------------------------------------------             00093000
           PERFORM 1000-INICIALIZAR.                                    00093100
           PERFORM 2000-PROCESSAR.                                      00093200
           PERFORM 3000-FINALIZAR.                                      00093300
           STOP RUN                                                     00093400
      *----------------------------------------------------             00093500
       0000-99-FIM.                                  EXIT.              00093600
      *----------------------------------------------------             00093700
                                                                        00093800
      *----------------------------------------------------             00093900
       1000-INICIALIZAR                           SECTION.              00094000
      *----------------------------------------------------             00094100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094200
      *----------------------------------------------------             00094300
       1000-99-FIM.                                  EXIT.              00094400
      *----------------------------------------------------             00094500
                                                                        00094600
      *----------------------------------------------------             00094700
       2000-PROCESSAR                             SECTION.              00094800
      *----------------------------------------------------             00094900
           DISPLAY 'WRK-N1  : '   WRK-N1.                               00095000
           DISPLAY 'WRK-N2  : '   WRK-N2.                               00095100
             COMPUTE WRK-MEDIA = ( WRK-N1 + WRK-N2 ) / 2.               00095200
             MOVE WRK-MEDIA TO WRK-MEDIA-ED.                            00095300
                                                                        00095400
           IF WRK-N1 IS NUMERIC AND WRK-N2 IS NUMERIC                   00095500
              IF WRK-MEDIA GREATER 7                                    00095600
                 DISPLAY 'MEDIA FINAL: ' WRK-MEDIA-ED                   00095700
                 DISPLAY 'APROVADO'                                     00095800
              ELSE                                                      00095900
                 DISPLAY 'MEDIA FINAL: ' WRK-MEDIA-ED                   00096000
                 DISPLAY 'REPROVADO'                                    00096100
              END-IF                                                    00096200
           ELSE                                                         00096300
              DISPLAY 'O VALOR FORNECIDO NAO E UM NUMERO'               00096400
           END-IF.                                                      00096500
      *----------------------------------------------------             00096600
       2000-99-FIM.                                  EXIT.              00096700
      *----------------------------------------------------             00096800
                                                                        00096900
      *----------------------------------------------------             00097000
       3000-FINALIZAR                             SECTION.              00097100
      *----------------------------------------------------             00097200
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00098000
      *----------------------------------------------------             00099000
       3000-99-FIM.                                  EXIT.              00100000
      *----------------------------------------------------             00110000
