      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB19.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: EVALUATE, FRETE ESTADOS.                *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-CODIGO      PIC 9(05)       VALUE ZEROS.               00091600
          05 WRK-PRODUTO     PIC X(10)       VALUE SPACES.              00091700
          05 WRK-VALOR       PIC 9(06)V99    VALUE ZEROS.               00091800
          05 WRK-ESTADO      PIC X(02)       VALUE SPACES.              00091900
      *----------------------------------------------------             00092000
       01 FILLER PIC X(48) VALUE                                        00092100
           '--------------VARIAVEIS DE APOIO-------------'.             00092200
      *----------------------------------------------------             00092300
       77 WRK-FRETE          PIC 9(06)V99    VALUE ZEROS.               00092400
       77 WRK-FLAG           PIC 9           VALUE 0.                   00092500
      *----------------------------------------------------             00092600
       01 FILLER PIC X(48) VALUE                                        00092700
           '--------------VARIAVEIS PARA MASCARAS--------'.             00092800
      *----------------------------------------------------             00092900
       77 WRK-VALOR-ED       PIC ZZZ.ZZ9,99.                            00093000
       77 WRK-FRETE-ED       PIC ZZZ.ZZ9,99.                            00093100
      *====================================================             00093200
       PROCEDURE                                 DIVISION.              00093300
      *====================================================             00093400
      *----------------------------------------------------             00093500
       0000-PRINCIPAL                             SECTION.              00093600
      *---------------------------------------------------              00093700
         PERFORM 1000-INICIALIZAR.                                      00093800
         PERFORM 2000-PROCESSAR.                                        00093900
         PERFORM 3000-FINALIZAR.                                        00094000
         STOP RUN.                                                      00094100
      *----------------------------------------------------             00094200
       0000-99-FIM.                                EXIT.                00094300
      *----------------------------------------------------             00094400
                                                                        00094500
      *----------------------------------------------------             00094600
       1000-INICIALIZAR                           SECTION.              00094700
      *----------------------------------------------------             00094800
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094900
      *----------------------------------------------------             00095000
       1000-99-FIM.                                EXIT.                00095100
      *----------------------------------------------------             00095200
                                                                        00095300
      *----------------------------------------------------             00095400
       2000-PROCESSAR                             SECTION.              00095500
      *----------------------------------------------------             00095600
           IF WRK-VALOR LESS 1000                                       00095700
            DISPLAY ' RETIRAR O PRODUTO NA LOJA'                        00095800
           ELSE                                                         00095900
            EVALUATE WRK-ESTADO                                         00096000
             WHEN 'SP'                                                  00096100
              COMPUTE WRK-FRETE = WRK-VALOR * 0,10                      00096200
              MOVE 1 TO WRK-FLAG                                        00096300
             WHEN 'RJ'                                                  00096400
              COMPUTE WRK-FRETE = WRK-VALOR * 0,15                      00096500
              MOVE 1 TO WRK-FLAG                                        00096600
             WHEN 'MG'                                                  00096700
              COMPUTE WRK-FRETE = WRK-VALOR * 0,20                      00096800
              MOVE 1 TO WRK-FLAG                                        00096900
             WHEN OTHER                                                 00097000
               DISPLAY 'VOCE DEVE RETIRAR O PRODUTO NA LOJA'            00097100
            END-EVALUATE                                                00097200
           END-IF.                                                      00097300
                                                                        00097400
            IF WRK-FLAG EQUAL 1                                         00097500
                 DISPLAY 'CODIGO:  ' WRK-CODIGO                         00097600
                 DISPLAY 'PRODUTO: ' WRK-PRODUTO                        00097700
                 MOVE WRK-VALOR TO WRK-VALOR-ED                         00097800
                 DISPLAY 'VALOR :  ' WRK-VALOR-ED                       00097900
                 DISPLAY 'ESTADO:  ' WRK-ESTADO                         00098000
                 MOVE WRK-FRETE TO WRK-FRETE-ED                         00098100
                 DISPLAY 'FRETE:   ' WRK-FRETE-ED                       00098200
            END-IF.                                                     00098300
      *----------------------------------------------------             00098400
       2000-99-FIM.                                EXIT.                00098500
      *----------------------------------------------------             00098600
                                                                        00098700
      *----------------------------------------------------             00098800
       3000-FINALIZAR                             SECTION.              00098900
      *----------------------------------------------------             00099000
         DISPLAY '----------FIM DO PROGRAMA-----------'.                00099100
      *----------------------------------------------------             00099200
       3000-99-FIM.                                EXIT.                00099300
      *----------------------------------------------------             00099400
                                                                        00099500
      *----------------------------------------------------             00099600
       9000-TRATA-ERROS                            SECTION.             00099700
      *----------------------------------------------------             00099800
      *----------------------------------------------------             00099900
       9000-99-FIM.                                EXIT.                00100000
      *----------------------------------------------------             00110000
