      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB13.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO DIVIDE COM ON SIZE ERROR       *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                               SECTION.             00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090800
                                                                        00090900
      *====================================================             00091000
       DATA                                      DIVISION.              00091100
      *====================================================             00091200
      *----------------------------------------------------             00091300
       WORKING-STORAGE                           SECTION.               00091400
      *----------------------------------------------------             00091500
       01 WRK-DADOS.                                                    00091600
          05 WRK-MES          PIC 9(02)    VALUE ZEROS.                 00091700
          05 WRK-TOTALVENDAS  PIC 9(08)V99 VALUE ZEROS.                 00091800
          05 WRK-TOTALFUNC    PIC 9(03)V99 VALUE ZEROS.                 00091900
                                                                        00092000
      *----------------------------------------------------             00092100
       01 FILLER PIC X(48) VALUE                                        00092200
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092300
      *----------------------------------------------------             00092400
       77 WRK-RES             PIC 9(08)V99 VALUE 0.                     00092500
       77 WRK-RES-ED          PIC ZZ.ZZZ.ZZ9,99.                        00092600
      *====================================================             00092700
       PROCEDURE                                 DIVISION.              00092800
      *====================================================             00092900
      *----------------------------------------------------             00093000
       0000-PRINCIPAL                             SECTION.              00093100
      *----------------------------------------------------             00093200
           PERFORM 1000-INICIALIZAR.                                    00093300
           PERFORM 2000-PROCESSAR.                                      00093400
           PERFORM 3000-FINALIZAR.                                      00093500
           STOP RUN.                                                    00093600
      *----------------------------------------------------             00093700
       0000-99-FIM.                                  EXIT.              00093800
      *----------------------------------------------------             00093900
                                                                        00094000
      *----------------------------------------------------             00094100
       1000-INICIALIZAR                           SECTION.              00094200
      *----------------------------------------------------             00094300
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094400
      *----------------------------------------------------             00094500
       1000-99-FIM.                                  EXIT.              00094600
      *----------------------------------------------------             00094700
                                                                        00094800
      *----------------------------------------------------             00094900
       2000-PROCESSAR                             SECTION.              00095000
      *----------------------------------------------------             00095100
           DISPLAY 'WRK-MES:           ' WRK-MES.                       00095201
           DISPLAY 'WRK-TOTALVENDAS:   ' WRK-TOTALVENDAS.               00095301
           DISPLAY 'WRK-TOTALFUNC:     ' WRK-TOTALFUNC.                 00095401
            DIVIDE WRK-TOTALVENDAS BY WRK-TOTALFUNC                     00095501
                   GIVING WRK-RES                                       00095601
             ON SIZE ERROR                                              00095701
               DISPLAY 'ERRO NA DIVISAO'                                00095801
             NOT ON SIZE ERROR                                          00095901
               DISPLAY 'WRK-MEDIADEVENDAS:  '   WRK-RES                 00096001
               MOVE WRK-RES TO WRK-RES-ED                               00096101
               DISPLAY 'WRK-MEDIADEVENDAS-ED: ' WRK-RES-ED              00096201
            END-DIVIDE.                                                 00096300
      *----------------------------------------------------             00096401
       2000-99-FIM.                                  EXIT.              00096501
      *----------------------------------------------------             00096601
                                                                        00096701
      *----------------------------------------------------             00096801
       3000-FINALIZAR                             SECTION.              00096901
      *----------------------------------------------------             00097001
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097101
      *----------------------------------------------------             00098001
       3000-99-FIM.                                  EXIT.              00099001
      *----------------------------------------------------             00100001
