      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB02.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: IMPRIMINDO VARIAVEIS                    *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
                                                                        00091000
      *====================================================             00100000
       DATA                                      DIVISION.              00110000
      *====================================================             00120000
      *----------------------------------------------------             00121000
       WORKING-STORAGE                           SECTION.               00130000
      *----------------------------------------------------             00130100
      *----------------------------------------------------             00130200
       01 FILLER PIC X(48) VALUE                                        00130300
           '--------------VARIAVEIS PARA EXIBICAO--------'.             00130400
      *----------------------------------------------------             00130500
       77 NOME    PICTURE X(20) VALUE SPACES.                           00131000
       77 SALARIO PICTURE 9(05) VALUE ZEROS.                            00132000
      *====================================================             00140000
       PROCEDURE                                 DIVISION.              00150000
      *====================================================             00160000
      *----------------------------------------------------             00160100
       0000-PRINCIPAL                             SECTION.              00160200
      *----------------------------------------------------             00160300
           PERFORM 1000-INICIALIZAR.                                    00160400
           PERFORM 2000-PROCESSAR.                                      00160500
           PERFORM 3000-FINALIZAR.                                      00160600
           STOP RUN.                                                    00160701
      *----------------------------------------------------             00160800
       0000-99-FIM.                                  EXIT.              00160900
      *----------------------------------------------------             00161000
                                                                        00161100
      *----------------------------------------------------             00161200
       1000-INICIALIZAR                           SECTION.              00161300
      *----------------------------------------------------             00161400
           ACCEPT NOME    FROM SYSIN.                                   00161500
           ACCEPT SALARIO FROM SYSIN.                                   00162000
      *----------------------------------------------------             00163000
       1000-99-FIM.                                  EXIT.              00164000
      *----------------------------------------------------             00165000
                                                                        00166000
      *----------------------------------------------------             00167000
       2000-PROCESSAR                             SECTION.              00168000
      *----------------------------------------------------             00169000
           DISPLAY 'MEU NOME... ' NOME.                                 00170000
           DISPLAY 'SALARIO... '  SALARIO.                              00171000
      *----------------------------------------------------             00172000
       2000-99-FIM.                                  EXIT.              00173000
      *----------------------------------------------------             00174000
                                                                        00175000
      *----------------------------------------------------             00176000
       3000-FINALIZAR                             SECTION.              00177000
      *----------------------------------------------------             00178000
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00180001
      *----------------------------------------------------             00190000
       3000-99-FIM.                                  EXIT.              00200000
      *----------------------------------------------------             00210000
