      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB03.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: IMPRIMINDO VARIAVEIS                    *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
                                                                        00090500
      *====================================================             00090600
       DATA                                      DIVISION.              00090700
      *====================================================             00090800
      *----------------------------------------------------             00090900
       WORKING-STORAGE                           SECTION.               00091000
      *----------------------------------------------------             00091100
       01 WRK-DADOS.                                                    00091200
          05 WRK-CODIGO  PIC X(07) VALUE SPACES.                        00091300
          05 WRK-NOME    PIC X(23) VALUE SPACES.                        00092000
          05 WRK-AREA    PIC X(7)  VALUE SPACES.                        00092100
          05 WRK-ESTADO  PIC X(02) VALUE SPACES.                        00092200
          05 WRK-SALARIO PIC 9(05) VALUE ZEROS.                         00092300
      *====================================================             00093000
       PROCEDURE                                 DIVISION.              00094000
      *====================================================             00095000
      *----------------------------------------------------             00095100
       0000-PRINCIPAL                             SECTION.              00095200
      *----------------------------------------------------             00095300
           PERFORM 1000-INICIALIZAR.                                    00095400
           PERFORM 2000-PROCESSAR.                                      00095500
           PERFORM 3000-FINALIZAR.                                      00095600
           STOP RUN.                                                    00095701
      *----------------------------------------------------             00095800
       0000-99-FIM.                                  EXIT.              00095900
      *----------------------------------------------------             00096000
                                                                        00096100
      *----------------------------------------------------             00096200
       1000-INICIALIZAR                           SECTION.              00096300
      *----------------------------------------------------             00096400
           ACCEPT WRK-DADOS FROM SYSIN.                                 00096500
      *----------------------------------------------------             00097000
       1000-99-FIM.                                  EXIT.              00097100
      *----------------------------------------------------             00097200
                                                                        00097300
      *----------------------------------------------------             00097400
       2000-PROCESSAR                             SECTION.              00097500
      *----------------------------------------------------             00097600
           DISPLAY 'CODIGO: '   WRK-CODIGO.                             00098000
           DISPLAY 'NOME:   '   WRK-NOME.                               00099000
           DISPLAY 'AREA:   '   WRK-AREA.                               00099100
           DISPLAY 'ESTADO: '   WRK-ESTADO.                             00099200
           DISPLAY 'SALARIO:'   WRK-SALARIO.                            00099300
      *----------------------------------------------------             00099400
       2000-99-FIM.                                  EXIT.              00099500
      *----------------------------------------------------             00099600
                                                                        00099700
      *----------------------------------------------------             00099800
       3000-FINALIZAR                             SECTION.              00099900
      *----------------------------------------------------             00100000
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00110001
      *----------------------------------------------------             00120000
       3000-99-FIM.                                  EXIT.              00130000
      *----------------------------------------------------             00140000
