      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB10.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO ADD 3 VARIAVEIS ACRESCENTADO   *             00081000
      *           10 AO RESULTADO.                        *             00082000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-N1      PIC 9(02)V99 VALUE ZEROS.                      00091600
          05 WRK-N2      PIC 9(02)V99 VALUE ZEROS.                      00091700
          05 WRK-N3      PIC 9(02)V99 VALUE ZEROS.                      00091800
                                                                        00091901
      *----------------------------------------------------             00092001
       01 FILLER PIC X(48) VALUE                                        00092101
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092201
      *----------------------------------------------------             00092301
       77 WRK-N4         PIC 9(03)V99 VALUE ZEROS.                      00092400
       77 WRK-N4-ED      PIC ZZ9,99.                                    00092500
      *====================================================             00092600
       PROCEDURE                                 DIVISION.              00092700
      *====================================================             00092800
      *----------------------------------------------------             00092901
       0000-PRINCIPAL                             SECTION.              00093001
      *----------------------------------------------------             00093101
           PERFORM 1000-INICIALIZAR.                                    00093201
           PERFORM 2000-PROCESSAR.                                      00093301
           PERFORM 3000-FINALIZAR.                                      00093401
           STOP RUN.                                                    00093501
      *----------------------------------------------------             00093601
       0000-99-FIM.                                  EXIT.              00093701
      *----------------------------------------------------             00093801
                                                                        00093901
      *----------------------------------------------------             00094001
       1000-INICIALIZAR                           SECTION.              00094101
      *----------------------------------------------------             00094201
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094300
      *----------------------------------------------------             00094401
       1000-99-FIM.                                  EXIT.              00094501
      *----------------------------------------------------             00094601
                                                                        00094701
      *----------------------------------------------------             00094801
       2000-PROCESSAR                             SECTION.              00094901
      *----------------------------------------------------             00095001
           DISPLAY 'WRK-N1:  '   WRK-N1.                                00095100
           DISPLAY 'WRK-N2:  '   WRK-N2.                                00095200
           DISPLAY 'WRK-N3:  '   WRK-N3.                                00095300
            ADD WRK-N1 WRK-N2 WRK-N3 TO WRK-N4.                         00095400
            ADD 10 TO WRK-N4.                                           00095500
           DISPLAY 'WRK-N4:  '   WRK-N4.                                00095600
            MOVE WRK-N4 TO WRK-N4-ED.                                   00095700
           DISPLAY 'WRK-N4-ED:'  WRK-N4-ED.                             00095800
      *----------------------------------------------------             00095901
       2000-99-FIM.                                  EXIT.              00096001
      *----------------------------------------------------             00096101
                                                                        00096201
      *----------------------------------------------------             00096301
       3000-FINALIZAR                             SECTION.              00096401
      *----------------------------------------------------             00096501
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097001
      *----------------------------------------------------             00098001
       3000-99-FIM.                                  EXIT.              00099001
      *----------------------------------------------------             00100001
