      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB20.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: EVALUATE, MEDIA.                        *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-NOTA1       PIC 9(02)V99    VALUE ZEROS.               00091600
          05 WRK-NOTA2       PIC 9(02)V99    VALUE ZEROS.               00091700
      *----------------------------------------------------             00091800
       01 FILLER PIC X(48) VALUE                                        00091900
           '--------------VARIAVEIS CALCULAR/MASCARA-----'.             00092000
      *----------------------------------------------------             00092100
       77 WRK-MEDIA          PIC 9(02)V99    VALUE ZEROS.               00092200
       77 WRK-MEDIA-ED       PIC Z9,99.                                 00092400
      *====================================================             00092500
       PROCEDURE                                 DIVISION.              00092600
      *====================================================             00092700
      *----------------------------------------------------             00092800
       0000-PRINCIPAL                             SECTION.              00092900
      *----------------------------------------------------             00093000
           PERFORM 1000-INICIALIZAR.                                    00093100
           PERFORM 2000-PROCESSAR.                                      00093200
           PERFORM 3000-FINALIZAR.                                      00093300
           STOP RUN.                                                    00093400
      *----------------------------------------------------             00093500
       0000-99-FIM.                                EXIT.                00093600
      *----------------------------------------------------             00093700
                                                                        00093800
      *----------------------------------------------------             00093900
       1000-INICIALIZAR                           SECTION.              00094000
      *----------------------------------------------------             00094100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094200
      *----------------------------------------------------             00094300
       1000-99-FIM.                                EXIT.                00094400
      *----------------------------------------------------             00094500
                                                                        00094600
      *----------------------------------------------------             00094700
       2000-PROCESSAR                             SECTION.              00094800
      *----------------------------------------------------             00094900
           COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2.           00095000
             EVALUATE WRK-MEDIA                                         00095100
                WHEN 0 THRU 1,99                                        00095200
                 DISPLAY 'NOTA1: ' WRK-NOTA1                            00095300
                 DISPLAY 'NOTA2: ' WRK-NOTA2                            00095400
                 MOVE WRK-MEDIA TO WRK-MEDIA-ED                         00095500
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00095600
                 DISPLAY 'REPROVADO'                                    00095700
                WHEN 2 THRU 5,99                                        00095800
                 DISPLAY 'NOTA1: ' WRK-NOTA1                            00095900
                 DISPLAY 'NOTA2: ' WRK-NOTA2                            00096000
                 MOVE WRK-MEDIA TO WRK-MEDIA-ED                         00096100
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00096200
                 DISPLAY 'RECUPERACAO'                                  00096300
                WHEN 6 THRU 8,99                                        00096400
                 DISPLAY 'NOTA1: ' WRK-NOTA1                            00096500
                 DISPLAY 'NOTA2: ' WRK-NOTA2                            00096600
                 MOVE WRK-MEDIA TO WRK-MEDIA-ED                         00096700
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00096800
                 DISPLAY 'APROVADO'                                     00096900
                WHEN 9 THRU 10                                          00097000
                 DISPLAY 'NOTA1: ' WRK-NOTA1                            00097100
                 DISPLAY 'NOTA2: ' WRK-NOTA2                            00097200
                 MOVE WRK-MEDIA TO WRK-MEDIA-ED                         00097300
                 DISPLAY 'MEDIA: ' WRK-MEDIA-ED                         00097400
                 DISPLAY 'APROVADO COM LOUVOR'                          00097500
                WHEN OTHER                                              00097600
                 DISPLAY 'MEDIA ERRADA'                                 00097700
             END-EVALUATE.                                              00097800
      *----------------------------------------------------             00097900
       2000-99-FIM.                                EXIT.                00098000
      *----------------------------------------------------             00098100
                                                                        00098200
      *----------------------------------------------------             00098300
       3000-FINALIZAR                             SECTION.              00098400
      *----------------------------------------------------             00098500
        DISPLAY '----------FIM DO PROGRAMA-----------'.                 00098600
      *----------------------------------------------------             00098700
       3000-99-FIM.                                EXIT.                00098800
      *----------------------------------------------------             00098900
                                                                        00099000
      *----------------------------------------------------             00099100
       9000-TRATA-ERROS                            SECTION.             00099200
      *----------------------------------------------------             00100000
      *----------------------------------------------------             00110000
       9000-99-FIM.                                EXIT.                00120000
      *----------------------------------------------------             00130000
