      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB25.                                            00040000
      *===================================================*             00060000
      *  AUTOR   : VICTOR LEAL                            *             00070000
      *  EMPRESA : FOURSYS                                *             00080000
      *  OBJETIVO: DESAFIO TABUADA                        *             00081000
      *===================================================*             00090000
                                                                        00100000
      *====================================================             00110000
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================             00130000
       CONFIGURATION                             SECTION.               00131000
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *====================================================             00135000
       DATA                                      DIVISION.              00136000
      *====================================================             00137000
      *----------------------------------------------------             00137100
       WORKING-STORAGE                         SECTION.                 00138000
      *----------------------------------------------------             00138100
       01 WRK-DADOS.                                                    00139000
          05 WRK-NUMERO        PIC 9(02)    VALUE ZEROS.                00140000
       77 WRK-CONT             PIC 9(02)    VALUE 1.                    00151000
       77 WRK-TOTAL            PIC 9(04)    VALUE ZEROS.                00152000
      *====================================================             00153000
       PROCEDURE                                 DIVISION.              00154000
      *====================================================             00155000
      *----------------------------------------------------             00156000
       0000-PRINCIPAL                            SECTION.               00157000
      *----------------------------------------------------             00157100
           PERFORM 1000-INICIALIZAR.                                    00157200
           PERFORM 2000-PROCESSAR UNTIL WRK-NUMERO                      00157300
                   EQUAL ZEROS.                                         00157400
           PERFORM 3000-FINALIZAR.                                      00157500
           STOP RUN.                                                    00157600
      *----------------------------------------------------             00157700
       0000-99-FIM.                                  EXIT.              00157800
      *----------------------------------------------------             00157900
                                                                        00158000
      *----------------------------------------------------             00158100
       1000-INICIALIZAR                           SECTION.              00158200
      *----------------------------------------------------             00158300
           ACCEPT WRK-DADOS FROM SYSIN.                                 00158400
      *----------------------------------------------------             00158500
       1000-99-FIM.                                  EXIT.              00158600
      *----------------------------------------------------             00158700
                                                                        00158800
      *----------------------------------------------------             00158900
       2000-PROCESSAR                             SECTION.              00159000
      *----------------------------------------------------             00159100
           PERFORM 2100-CALCULAR 10 TIMES.                              00159200
             ADD 1 TO WRK-CONT.                                         00159300
             INITIALIZE WRK-DADOS.                                      00159400
             ACCEPT WRK-DADOS FROM SYSIN.                               00159500
      *----------------------------------------------------             00159600
       2000-99-FIM.                                  EXIT.              00159700
      *----------------------------------------------------             00160000
                                                                        00160100
      *----------------------------------------------------             00160200
       2100-CALCULAR                              SECTION.              00160300
      *----------------------------------------------------             00160400
           COMPUTE WRK-TOTAL = WRK-NUMERO * WRK-CONT.                   00160500
           DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-TOTAL.           00160600
      *----------------------------------------------------             00160700
       2100-99-FIM.                                  EXIT.              00160800
      *----------------------------------------------------             00160900
                                                                        00161000
      *----------------------------------------------------             00161100
       3000-FINALIZAR                             SECTION.              00161200
      *----------------------------------------------------             00161300
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00161400
      *----------------------------------------------------             00161500
       3000-99-FIM.                                  EXIT.              00162000
      *----------------------------------------------------             00163000
