      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22DB09.                                            00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060005
      *  EMPRESA : FOURSYS                                *             00070005
      *  OBJETIVO: LEITURA DE UM REGISTRO USANDO DB2,     *             00080000
      *            REALIZANDO TRATAMENTO DE ERROS.        *             00080100
      *---------------------------------------------------*             00080201
      *  BASE  DE DADOS:                                  *             00080301
      *  TABELA             I/O           INCLUDE/BOOK    *             00080401
      *  IVAN.FUNC           I               #BKFUNC      *             00080501
      *===================================================*             00081000
                                                                        00082000
      *====================================================             00083000
       ENVIRONMENT                               DIVISION.              00084000
      *====================================================             00085000
       CONFIGURATION                             SECTION.               00086000
       SPECIAL-NAMES.                                                   00087000
           DECIMAL-POINT  IS COMMA.                                     00088000
                                                                        00089000
      *====================================================             00090000
       DATA                                      DIVISION.              00100000
      *====================================================             00110000
      *-----------------------------------------------------            00120000
       FILE                                      SECTION.               00130000
      *-----------------------------------------------------            00131000
                                                                        00132000
      *-----------------------------------------------------            00133000
       WORKING-STORAGE                           SECTION.               00134000
      *-----------------------------------------------------            00135000
           EXEC SQL                                                     00136000
              INCLUDE #BKFUNC                                           00137000
           END-EXEC.                                                    00137100
                                                                        00137200
           EXEC SQL                                                     00137300
              INCLUDE SQLCA                                             00137400
           END-EXEC.                                                    00137500
                                                                        00137600
      *----------------------------------------------------             00137701
       01 FILLER PIC X(48) VALUE                                        00137801
            '-----------VARIAVEIS DE APOIO--------------'.              00137901
      *----------------------------------------------------             00138001
       77 WRK-ID          PIC 9(05) VALUE ZEROS.                        00138100
       77 WRK-SQLCODE     PIC -999.                                     00138200
       77 WRK-NULL-EMAIL  PIC S9(04) COMP.                              00138300
      *====================================================             00138400
       PROCEDURE                                 DIVISION.              00138500
      *====================================================             00138600
      *-----------------------------------------------------            00138700
       0000-PRINCIPAL                             SECTION.              00138800
      *-----------------------------------------------------            00138900
           PERFORM 1000-INICIALIZAR.                                    00139000
            PERFORM 1500-LER.                                           00139103
            IF SQLCODE EQUAL 0                                          00139203
             PERFORM 2000-PROCESSAR                                     00139303
            END-IF.                                                     00139403
           PERFORM 3000-FINALIZAR.                                      00139500
           GOBACK.                                                      00139600
      *-----------------------------------------------------            00139700
       0000-99-FIM.                                  EXIT.              00140000
      *-----------------------------------------------------            00140100
                                                                        00140200
      *-----------------------------------------------------            00140300
       1000-INICIALIZAR                           SECTION.              00140400
      *-----------------------------------------------------            00140500
           ACCEPT WRK-ID FROM SYSIN.                                    00140600
      *-----------------------------------------------------            00140800
       1000-99-FIM.                                  EXIT.              00140900
      *-----------------------------------------------------            00141000
                                                                        00141100
      *-----------------------------------------------------            00142000
       1500-LER                                   SECTION.              00143000
      *-----------------------------------------------------            00144000
           MOVE WRK-ID TO DB2-ID.                                       00145000
                                                                        00146000
           EXEC SQL                                                     00147000
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00148000
            INTO :DB2-ID,                                               00149000
                 :DB2-NOME,                                             00150000
                 :DB2-SETOR,                                            00151000
                 :DB2-SALARIO,                                          00152000
                 :DB2-DATAADM,                                          00153000
                 :DB2-EMAIL      :WRK-NULL-EMAIL                        00154000
           FROM IVAN.FUNC                                               00155000
            WHERE ID = :DB2-ID                                          00156000
      *      FETCH FIRST ROW ONLY                                       00156104
           END-EXEC.                                                    00157000
                                                                        00157100
           DISPLAY 'SQLWARN0..' SQLWARN0.                               00157200
           DISPLAY 'SQLSTATE..' SQLSTATE.                               00157300
                                                                        00157400
           IF (SQLCODE NOT EQUAL ZEROS AND 100) OR                      00157500
              (SQLWARN0 EQUAL 'W')                                      00157600
                 MOVE SQLCODE TO WRK-SQLCODE                            00157700
                 DISPLAY 'ERRO NA LEITURA' WRK-SQLCODE                  00157800
           END-IF.                                                      00157900
                                                                        00158000
           IF (SQLCODE EQUAL 100)                                       00158100
                 DISPLAY 'NAO ENCONTRADO' DB2-ID                        00158200
                                                                        00158300
           END-IF.                                                      00158400
      *-----------------------------------------------------            00160600
       1500-99-FIM.                                  EXIT.              00160700
      *-----------------------------------------------------            00160800
                                                                        00160900
      *-----------------------------------------------------            00161000
       2000-PROCESSAR                             SECTION.              00161100
      *-----------------------------------------------------            00161200
            DISPLAY 'ID: '      DB2-ID                                  00161401
            DISPLAY 'NOME:'     DB2-NOME                                00161501
            DISPLAY 'SETOR:'    DB2-SETOR                               00161601
            DISPLAY 'SALARIO:'  DB2-SALARIO                             00161701
            DISPLAY 'DATAADM:'  DB2-DATAADM                             00161801
             IF WRK-NULL-EMAIL = 0                                      00161901
              DISPLAY 'EMAIL' DB2-EMAIL                                 00162001
             ELSE                                                       00162101
              DISPLAY 'EMAIL NULO'                                      00162201
             END-IF.                                                    00162303
      *-----------------------------------------------------            00162500
       2000-99-FIM.                                  EXIT.              00162600
      *-----------------------------------------------------            00162700
                                                                        00162800
      *-----------------------------------------------------            00162900
       3000-FINALIZAR                             SECTION.              00163000
      *-----------------------------------------------------            00163100
           DISPLAY 'FIM DO PROGRAMA'.                                   00163200
      *-----------------------------------------------------            00163300
       3000-99-FIM.                                  EXIT.              00163400
      *-----------------------------------------------------            00164000
