      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB21.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: UTILIZAR VARIVAVEL 88, CRIANDO SECTION  *             00081000
      * COM PERFORM (BOAS PRATICAS).                      *             00082000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091200
       WORKING-STORAGE                            SECTION.              00091300
      *----------------------------------------------------             00091400
       01 WRK-DADOS.                                                    00091500
          05 WRK-DATA.                                                  00091600
             10 WRK-DIA      PIC 9(02)    VALUE ZEROS.                  00091700
             10 WRK-MES      PIC 9(02)    VALUE ZEROS.                  00091800
             10 WRK-ANO      PIC 9(04)    VALUE ZEROS.                  00091900
          05 WRK-VALOR       PIC 9(05)V99 VALUE ZEROS.                  00092000
          05 WRK-LANCAMENTO  PIC X(30)    VALUE SPACES.                 00092100
          05 WRK-TIPO        PIC X        VALUE SPACE.                  00092200
             88 WRK-TIPO-VALIDO               VALUE 'C' 'D'.            00092300
      *----------------------------------------------------             00092400
       01 FILLER PIC X(48) VALUE                                        00092500
           '--------------VARIAVEIS PARA MASCARA---------'.             00092600
      *----------------------------------------------------             00092700
       77 WRK-VALOR-ED       PIC ZZ.ZZ9,99.                             00092800
      *====================================================             00092900
       PROCEDURE                                 DIVISION.              00093000
      *====================================================             00093100
      *----------------------------------------------------             00093200
       0000-PRINCIPAL                             SECTION.              00093300
      *----------------------------------------------------             00093400
           PERFORM 1000-INICIALIZAR.                                    00093500
           PERFORM 2000-PROCESSAR.                                      00093600
           PERFORM 3000-FINALIZAR.                                      00093700
           STOP RUN.                                                    00093800
      *----------------------------------------------------             00093900
       0000-99-FIM.                                EXIT.                00094000
      *----------------------------------------------------             00094100
                                                                        00094200
      *----------------------------------------------------             00094300
       1000-INICIALIZAR                           SECTION.              00094400
      *----------------------------------------------------             00094500
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094600
      *----------------------------------------------------             00094700
       1000-99-FIM.                                EXIT.                00094800
      *----------------------------------------------------             00094900
                                                                        00095000
      *----------------------------------------------------             00095100
       2000-PROCESSAR                             SECTION.              00095200
      *----------------------------------------------------             00095300
              IF WRK-TIPO-VALIDO                                        00095400
                 DISPLAY 'DATA:       ' WRK-DIA '/'                     00095500
                         WRK-MES '/' WRK-ANO                            00095600
                 MOVE WRK-VALOR TO WRK-VALOR-ED                         00095700
                 DISPLAY 'VALOR:   R$ ' WRK-VALOR-ED                    00095800
                 DISPLAY 'LANCAMENTO: ' WRK-LANCAMENTO                  00095900
                  IF WRK-TIPO EQUAL 'C'                                 00096000
                   DISPLAY 'TIPO:CREDITO'                               00096100
                  ELSE                                                  00096200
                   DISPLAY 'TIPO:DEBITO '                               00096300
                  END-IF                                                00096400
              ELSE                                                      00096500
                 DISPLAY 'REGISTRO NAO VALIDO'                          00096600
              END-IF.                                                   00096700
      *----------------------------------------------------             00096800
       2000-99-FIM.                                EXIT.                00096900
      *----------------------------------------------------             00097000
                                                                        00097100
      *----------------------------------------------------             00097200
       3000-FINALIZAR                             SECTION.              00097300
      *----------------------------------------------------             00097400
            DISPLAY '----------FIM DO PROGRAMA-----------'.             00097500
      *----------------------------------------------------             00098000
       3000-99-FIM.                                EXIT.                00099000
      *----------------------------------------------------             00100000
                                                                        00110000
      *----------------------------------------------------             00120000
       9000-TRATA-ERROS                            SECTION.             00130000
      *----------------------------------------------------             00140000
      *----------------------------------------------------             00140100
       9000-99-FIM.                                EXIT.                00141000
      *----------------------------------------------------             00150000
