      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB14.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: OPERACAO MULTIPLY                       *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
       CONFIGURATION                              SECTION.              00090500
       SPECIAL-NAMES.                                                   00090600
           DECIMAL-POINT IS COMMA.                                      00090700
                                                                        00090800
      *====================================================             00090900
       DATA                                      DIVISION.              00091000
      *====================================================             00091100
      *----------------------------------------------------             00091201
       WORKING-STORAGE                           SECTION.               00091300
      *----------------------------------------------------             00091401
       01 WRK-DADOS.                                                    00091500
          05 WRK-FUNC         PIC X(15)    VALUE SPACES.                00091600
          05 WRK-TOTALVENDAS  PIC 9(05)V99 VALUE ZEROS.                 00091700
          05 WRK-COMISSAO     PIC 9(02)V99 VALUE ZEROS.                 00091800
                                                                        00091901
      *----------------------------------------------------             00092001
       01 FILLER PIC X(48) VALUE                                        00092101
           '--------------VARIAVEIS ACUMULAR/MASCARA-----'.             00092201
      *----------------------------------------------------             00092301
       77 WRK-RES             PIC 9(06)V99 VALUE ZEROS.                 00092400
       77 WRK-VAL-COM-ED      PIC ZZZ.ZZ9,99.                           00092500
      *====================================================             00092600
       PROCEDURE                                 DIVISION.              00092700
      *====================================================             00092800
      *----------------------------------------------------             00092901
       0000-PRINCIPAL                             SECTION.              00093001
      *----------------------------------------------------             00093101
           PERFORM 1000-INICIALIZAR.                                    00093201
           PERFORM 2000-PROCESSAR.                                      00093301
           PERFORM 3000-FINALIZAR.                                      00093401
           STOP RUN.                                                    00093501
      *----------------------------------------------------             00093601
       0000-99-FIM.                                  EXIT.              00093701
      *----------------------------------------------------             00093801
                                                                        00093901
      *----------------------------------------------------             00094001
       1000-INICIALIZAR                           SECTION.              00094101
      *----------------------------------------------------             00094201
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094300
      *----------------------------------------------------             00094401
       1000-99-FIM.                                  EXIT.              00094501
      *----------------------------------------------------             00094601
                                                                        00094701
      *----------------------------------------------------             00094801
       2000-PROCESSAR                             SECTION.              00094901
      *----------------------------------------------------             00095001
           DISPLAY 'WRK-FUNC:          '   WRK-FUNC.                    00095101
           DISPLAY 'WRK-TOTALVENDAS:   '   WRK-TOTALVENDAS.             00095201
           DISPLAY 'WRK-COMISSAO:      '   WRK-COMISSAO.                00095301
            MULTIPLY WRK-TOTALVENDAS BY WRK-COMISSAO                    00095401
                     GIVING WRK-RES.                                    00095501
           DISPLAY 'WRK-VALORCOMISSAO: '   WRK-RES.                     00095601
            MOVE WRK-RES TO WRK-VAL-COM-ED.                             00095700
           DISPLAY 'WRK-VAL-COMISSAO:  ' WRK-VAL-COM-ED.                00095801
      *----------------------------------------------------             00095901
       2000-99-FIM.                                  EXIT.              00096001
      *----------------------------------------------------             00096101
                                                                        00096201
      *----------------------------------------------------             00096301
       3000-FINALIZAR                             SECTION.              00096401
      *----------------------------------------------------             00096501
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097001
      *----------------------------------------------------             00098001
       3000-99-FIM.                                  EXIT.              00099001
      *----------------------------------------------------             00100001
