      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR22CB06.                                            00040000
      *===================================================*             00060000
      * AUTOR   : VICTOR LEAL                             *             00070000
      * EMPRESA : FOURSYS                                 *             00080000
      * OBJETIVO: UTILIZANDO REDEFINE COM FILLER          *             00081000
      *===================================================*             00090000
                                                                        00090100
      *====================================================             00090200
       ENVIRONMENT                               DIVISION.              00090300
      *====================================================             00090400
                                                                        00090500
      *====================================================             00090600
       DATA                                      DIVISION.              00090700
      *====================================================             00090800
      *----------------------------------------------------             00090900
       WORKING-STORAGE                           SECTION.               00091000
      *----------------------------------------------------             00091100
       01 WRK-DADOS.                                                    00091200
          05 WRK-ID            PIC 9(05) VALUE ZEROS.                   00091300
          05 WRK-NOME          PIC X(30) VALUE SPACES.                  00091400
          05 WRK-ENDERECO      PIC X(30) VALUE SPACES.                  00091500
                                                                        00091600
       01 WRK-DADOS-RED1       REDEFINES WRK-DADOS.                     00091700
          05 WRK-ID-RED1       PIC 9(05).                               00091800
          05 WRK-NOME-RED1     PIC X(30).                               00091900
                                                                        00092000
       01 WRK-DADOS-RED2       REDEFINES WRK-DADOS.                     00092100
          05 WRK-ID-RED2       PIC 9(05).                               00092200
                                                                        00092300
       01 WRK-DADOS-RED3       REDEFINES WRK-DADOS.                     00092400
          05 FILLER            PIC X(35).                               00092500
          05 WRK-ENDERECO-RED3 PIC X(30).                               00092600
      *====================================================             00092700
       PROCEDURE                                 DIVISION.              00092800
      *====================================================             00092900
      *----------------------------------------------------             00093000
       0000-PRINCIPAL                             SECTION.              00093100
      *----------------------------------------------------             00093200
           PERFORM 1000-INICIALIZAR.                                    00093300
           PERFORM 2000-PROCESSAR.                                      00093400
           PERFORM 3000-FINALIZAR.                                      00093500
           STOP RUN.                                                    00093600
      *----------------------------------------------------             00093700
       0000-99-FIM.                                  EXIT.              00093800
      *----------------------------------------------------             00093900
                                                                        00094000
      *----------------------------------------------------             00094100
       1000-INICIALIZAR                           SECTION.              00094200
      *----------------------------------------------------             00094300
           ACCEPT WRK-DADOS FROM SYSIN.                                 00094400
      *----------------------------------------------------             00094500
       1000-99-FIM.                                  EXIT.              00094600
      *----------------------------------------------------             00094700
                                                                        00094800
      *----------------------------------------------------             00094900
       2000-PROCESSAR                             SECTION.              00095000
      *----------------------------------------------------             00095100
           DISPLAY 'WRK-DADOS:      '   WRK-DADOS.                      00095200
           DISPLAY 'WRK-DADOS-RED1: '   WRK-DADOS-RED1.                 00095300
           DISPLAY 'WRK-DADOS-RED2: '   WRK-DADOS-RED2.                 00095400
           DISPLAY 'ENDERECO:       '   WRK-ENDERECO-RED3.              00095500
      *----------------------------------------------------             00095600
       2000-99-FIM.                                  EXIT.              00095700
      *----------------------------------------------------             00095800
                                                                        00095900
      *----------------------------------------------------             00096000
       3000-FINALIZAR                             SECTION.              00096100
      *----------------------------------------------------             00096200
           DISPLAY '----------FIM DO PROGRAMA-----------'.              00097000
      *----------------------------------------------------             00098000
       3000-99-FIM.                                  EXIT.              00099000
      *----------------------------------------------------             00100000
