      *====================================================             00001000
       IDENTIFICATION                            DIVISION.              00002000
      *====================================================             00003000
       PROGRAM-ID. FR22CB01.                                            00004000
      *===================================================*             00021000
      *  AUTOR   : VICTOR LEAL                            *             00022000
      *  EMPRESA : FOURSYS                                *             00023000
      *  OBJETIVO: PRIMEIRO PROGRAMA                      *             00025000
      *===================================================*             00025100
                                                                        00025200
      *====================================================             00025300
       ENVIRONMENT                               DIVISION.              00026000
      *====================================================             00026100
                                                                        00026200
      *====================================================             00026300
       DATA                                      DIVISION.              00027000
      *====================================================             00027100
                                                                        00027200
      *====================================================             00027300
       PROCEDURE                                 DIVISION.              00028000
      *====================================================             00028100
           DISPLAY 'MEU PRIMEIRO PROGRAMA - VICTOR'.                    00029000
           STOP RUN.                                                    00030000
