      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. GRAVALOG.                                            00040000
      *===================================================*             00050002
      *  AUTOR   : VICTOR LEAL                            *             00060002
      *  EMPRESA : FOURSYS                                *             00070002
      *  OBJETIVO: GRAVAR REGISTRO DE ERROS EM UM ARQUIVO.*             00080002
      *  ESTE E UM PROGRAMA DE MODULO, TEM LINKAGE SECTION*             00081002
      *---------------------------------------------------*             00081103
      *  ARQUIVOS:                                        *             00081203
      *  DDNAME             I/O           INCLUDE/BOOK    *             00081303
      *  LOGERROS            O             ---------      *             00081403
      *===================================================*             00082002
                                                                        00083000
      *====================================================             00084000
       ENVIRONMENT                               DIVISION.              00085000
      *====================================================             00086000
       CONFIGURATION                             SECTION.               00087000
       SPECIAL-NAMES.                                                   00088000
           DECIMAL-POINT  IS COMMA.                                     00089000
                                                                        00090000
       INPUT-OUTPUT                              SECTION.               00100000
       FILE-CONTROL.                                                    00110000
           SELECT LOGERROS ASSIGN TO LOGERROS                           00120000
               FILE STATUS IS WRK-FS-LOGERROS.                          00130000
                                                                        00131000
      *====================================================             00132000
       DATA                                      DIVISION.              00133000
      *====================================================             00133100
      *-----------------------------------------------------            00133200
       FILE                                      SECTION.               00133300
      *-----------------------------------------------------            00133400
       FD LOGERROS                                                      00133500
           RECORDING MODE IS F                                          00133600
           BLOCK CONTAINS 0 RECORDS.                                    00133700
                                                                        00133800
       01 FD-LOGERROS        PIC X(58).                                 00133900
                                                                        00137200
      *-----------------------------------------------------            00137300
       WORKING-STORAGE                           SECTION.               00137400
      *-----------------------------------------------------            00137500
       77 WRK-FS-LOGERROS    PIC 9(02).                                 00137600
       77 WRK-SIS-DATA       PIC 9(08).                                 00137700
       77 WRK-SIS-HORA       PIC X(06).                                 00137800
      *-----------------------------------------------------            00137900
       LINKAGE                                   SECTION.               00138000
      *-----------------------------------------------------            00138100
       01 COMMAREA.                                                     00138400
          05 LNK-PROGRAMA    PIC X(08).                                 00138500
          05 LNK-SECAO       PIC X(04).                                 00138600
          05 LNK-MENSAGEM    PIC X(30).                                 00138700
          05 LNK-STATUS      PIC X(02).                                 00138800
          05 LNK-DATA        PIC 9(08).                                 00138900
          05 LNK-HORA        PIC 9(06).                                 00139000
                                                                        00139100
      *====================================================             00139200
       PROCEDURE  DIVISION USING COMMAREA.                              00139300
      *====================================================             00139400
      *-----------------------------------------------------            00139500
       0000-PRINCIPAL                             SECTION.              00139600
      *-----------------------------------------------------            00139700
           OPEN EXTEND LOGERROS.                                        00139800
            ACCEPT WRK-SIS-DATA FROM DATE YYYYMMDD.                     00139900
            ACCEPT WRK-SIS-HORA FROM TIME.                              00140000
             MOVE WRK-SIS-DATA TO LNK-DATA.                             00140100
             MOVE WRK-SIS-HORA TO LNK-HORA.                             00140200
             MOVE COMMAREA     TO FD-LOGERROS.                          00140300
           WRITE FD-LOGERROS.                                           00141000
           CLOSE LOGERROS.                                              00142000
           GOBACK.                                                      00143000
      *-----------------------------------------------------            00150000
       0000-99-FIM.                                  EXIT.              00151000
      *-----------------------------------------------------            00152000
                                                                        00153000
      *-----------------------------------------------------            00154000
       1000-INICIALIZAR                           SECTION.              00155000
      *-----------------------------------------------------            00156000
      *-----------------------------------------------------            00158500
       1000-99-FIM.                                  EXIT.              00158600
      *-----------------------------------------------------            00158700
                                                                        00158800
      *-----------------------------------------------------            00158900
       2000-PROCESSAR                             SECTION.              00159000
      *-----------------------------------------------------            00159100
      *-----------------------------------------------------            00160400
       2000-99-FIM.                                  EXIT.              00160500
      *-----------------------------------------------------            00160600
                                                                        00160700
      *-----------------------------------------------------            00160800
       3000-FINALIZAR                             SECTION.              00160900
      *-----------------------------------------------------            00161000
      *-----------------------------------------------------            00162600
       3000-99-FIM.                                  EXIT.              00162700
      *-----------------------------------------------------            00165100
                                                                        00165202
      *-----------------------------------------------------            00165302
       9000-TRATA-ERROS                           SECTION.              00165400
      *-----------------------------------------------------            00165500
      *-----------------------------------------------------            00165600
       9000-99-FIM.                                  EXIT.              00165700
      *-----------------------------------------------------            00166000
