      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. MD022201.                                            00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: FAZER A LEITURA DO ARQUIVO EVSA0407,   *             00080000
      *            FORMATAR OS DADOS EM UM ARQUIVO        *             00080100
      *            SEQUENCIAL COM REGISTROS ONDE SALDO FOR*             00080200
      *            MAIOR QUE 0; SALDOS MENORES DEVER O SER*             00080300
      *            DESPREZADOS NA SYSOUT.                 *             00080400
      *---------------------------------------------------*             00080500
      *  ARQUIVOS:                                        *             00080608
      *  DDNAME             I/O           INCLUDE/BOOK    *             00080708
      *  EVSA0407            I             ---------      *             00080808
      *  SVSA0407            O              I#BV0407      *             00080914
      *===================================================*             00081008
                                                                        00081108
      *====================================================             00081200
       ENVIRONMENT                               DIVISION.              00081300
      *====================================================             00081400
       CONFIGURATION                             SECTION.               00081500
       SPECIAL-NAMES.                                                   00082000
           DECIMAL-POINT  IS COMMA.                                     00083000
                                                                        00084000
       INPUT-OUTPUT                              SECTION.               00085000
       FILE-CONTROL.                                                    00086000
           SELECT EVSA0407 ASSIGN TO EVSA0407                           00087001
               ORGANIZATION IS INDEXED                                  00088000
               ACCESS MODE  IS SEQUENTIAL                               00089001
               RECORD KEY   IS ARQ-CHAVE                                00090000
               FILE STATUS  IS WRK-FS-EVSA0407.                         00100001
                                                                        00101008
           SELECT SVSA0407 ASSIGN TO SVSA0407                           00102008
               FILE STATUS IS WRK-FS-SVSA0407.                          00103008
                                                                        00110000
      *====================================================             00120000
       DATA                                      DIVISION.              00130000
      *====================================================             00130100
      *----------------------------------------------------             00130200
       FILE                                      SECTION.               00130300
      *----------------------------------------------------             00130400
       FD EVSA0407.                                                     00130501
       01 REG-EVSA0407.                                                 00130601
          05 ARQ-CHAVE.                                                 00130701
             10 ARQ-AGENCIA     PIC X(04).                              00130801
             10 ARQ-CONTA       PIC X(05).                              00130901
          05 ARQ-SALARIO        PIC X(10).                              00131001
                                                                        00134000
       FD SVSA0407                                                      00134109
            RECORDING MODE IS F                                         00134209
            BLOCK CONTAINS 0 RECORDS.                                   00134306
       01 FD-SVSA0407-REG       PIC X(27).                              00134417
                                                                        00134506
      *----------------------------------------------------             00135000
       WORKING-STORAGE                           SECTION.               00136000
      *----------------------------------------------------             00137000
          COPY 'I#BV0407'.                                              00137106
      *----------------------------------------------------             00137200
       01 FILLER PIC X(48) VALUE                                        00137300
           '--------------AREA FILE STATUS---------------'.             00137400
      *----------------------------------------------------             00137500
       77 WRK-FS-EVSA0407    PIC 9(02).                                 00137601
       77 WRK-FS-SVSA0407    PIC 9(02).                                 00137706
      *----------------------------------------------------             00137807
       01 FILLER PIC X(48) VALUE                                        00137907
           '--------------AREA PARA ACUMULAR-------------'.             00138007
      *----------------------------------------------------             00138107
       77 WRK-REGLIDOS       PIC 9(02).                                 00138207
       77 WRK-REGGRAV        PIC 9(02).                                 00138312
       77 WRK-REGEXCE        PIC 9(02).                                 00138416
      *====================================================             00138500
       PROCEDURE                                 DIVISION.              00138600
      *====================================================             00138700
      *----------------------------------------------------             00138800
       0000-PRINCIPAL                             SECTION.              00138900
      *-----------------------------------------------------            00139000
           PERFORM 1000-INICIALIZAR.                                    00139100
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-EVSA0407                 00139202
                   EQUAL 10.                                            00139302
           PERFORM 3000-FINALIZAR.                                      00139400
           STOP RUN.                                                    00139500
      *-----------------------------------------------------            00139600
       0000-99-FIM.                                  EXIT.              00139700
      *-----------------------------------------------------            00139800
                                                                        00139900
      *-----------------------------------------------------            00140000
       1000-INICIALIZAR                           SECTION.              00140100
      *-----------------------------------------------------            00140200
           OPEN INPUT EVSA0407.                                         00140301
            PERFORM 1100-TESTA-EVSA0407.                                00140420
                                                                        00141008
           OPEN OUTPUT SVSA0407.                                        00141108
            PERFORM 1200-TESTA-SVSA0407.                                00141220
                                                                        00141320
           READ EVSA0407.                                               00141901
           ACCEPT WRK-SVSA0407-DADOS-DATA FROM DATE YYYYMMDD.           00142019
      *-----------------------------------------------------            00142100
       1000-99-FIM.                                  EXIT.              00142200
      *-----------------------------------------------------            00142300
                                                                        00142800
      *-----------------------------------------------------            00142920
       1100-TESTA-EVSA0407                        SECTION.              00143020
      *-----------------------------------------------------            00143120
           IF WRK-FS-EVSA0407 NOT EQUAL ZEROS                           00143220
            DISPLAY 'ERRO NA ABERTURA DO ARQUIVO EVSA0407'              00143320
            DISPLAY 'CODIGO VSAM: ' WRK-FS-EVSA0407                     00143420
            PERFORM 3000-99-FIM                                         00143520
           END-IF.                                                      00143620
      *-----------------------------------------------------            00143720
       1100-99-FIM.                                  EXIT.              00143820
      *-----------------------------------------------------            00143920
                                                                        00144020
      *-----------------------------------------------------            00144120
       1200-TESTA-SVSA0407                        SECTION.              00144220
      *-----------------------------------------------------            00144320
           IF WRK-FS-SVSA0407 NOT EQUAL ZEROS                           00144420
            DISPLAY 'ERRO NA ABERTURA DO ARQUIVO SVSA0407'              00144520
            DISPLAY 'CODIGO VSAM: ' WRK-FS-SVSA0407                     00144620
            PERFORM 3000-99-FIM                                         00144720
           END-IF.                                                      00144820
      *-----------------------------------------------------            00144920
       1200-99-FIM.                                  EXIT.              00145020
      *-----------------------------------------------------            00145120
                                                                        00145220
      *-----------------------------------------------------            00145500
       2000-PROCESSAR                             SECTION.              00145600
      *-----------------------------------------------------            00145700
           ADD 1 TO WRK-REGLIDOS.                                       00146007
           IF ARQ-SALARIO EQUAL TO ZERO OR ARQ-SALARIO IS               00146422
              NOT NUMERIC                                               00146521
            ADD 1 TO WRK-REGEXCE                                        00146616
            DISPLAY 'SALARIO DESPREZADO: ' WRK-CORPO                    00146712
           ELSE                                                         00146807
            ADD 1 TO WRK-REGGRAV                                        00146914
            MOVE ARQ-AGENCIA   TO WRK-SVSA0407-DADOS-AGENCIA            00147007
            MOVE ARQ-CONTA     TO WRK-SVSA0407-DADOS-CONTA              00147107
            MOVE ARQ-SALARIO   TO WRK-SVSA0407-DADOS-SALARIO            00147207
            WRITE FD-SVSA0407-REG FROM WRK-CORPO                        00147414
           END-IF.                                                      00147507
            READ EVSA0407.                                              00148007
      *-----------------------------------------------------            00154000
       2000-99-FIM.                                  EXIT.              00155000
      *-----------------------------------------------------            00156000
                                                                        00157000
      *-----------------------------------------------------            00158000
       3000-FINALIZAR                             SECTION.              00159000
      *-----------------------------------------------------            00160000
           CLOSE EVSA0407.                                              00160101
           CLOSE SVSA0407.                                              00160207
           DISPLAY '  '.                                                00160307
           DISPLAY 'REGISTROS LIDOS: '    WRK-REGLIDOS.                 00160416
           DISPLAY 'REGISTROS GRAVADOS: ' WRK-REGGRAV.                  00160512
           DISPLAY 'REGISTROS EXCECAO: '  WRK-REGEXCE.                  00160616
           DISPLAY 'FIM DE PROCESSAMENTO'.                              00160700
      *-----------------------------------------------------            00160800
       3000-99-FIM.                                  EXIT.              00160900
      *-----------------------------------------------------            00161000
                                                                        00162000
