      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. PROGX.                                               00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: GRAVAR REGISTROS DE ERROS EM ARQUIVO   *             00080000
      *===================================================*             00082000
                                                                        00083000
      *====================================================             00084000
       ENVIRONMENT                               DIVISION.              00085000
      *====================================================             00086000
                                                                        00131000
      *====================================================             00132000
       DATA                                      DIVISION.              00133000
      *====================================================             00133100
      *-----------------------------------------------------            00133200
       FILE                                      SECTION.               00133300
      *-----------------------------------------------------            00133400
                                                                        00137100
      *-----------------------------------------------------            00137200
       WORKING-STORAGE                           SECTION.               00137300
      *-----------------------------------------------------            00137400
       01 WRK-DADOS.                                                    00137500
          05 WRK-PROGRAMA    PIC X(08).                                 00137600
          05 WRK-SECAO       PIC X(04).                                 00137700
          05 WRK-MENSAGEM    PIC X(30).                                 00137800
          05 WRK-STATUS      PIC X(02).                                 00137900
          05 WRK-FILLER      PIC X(14).                                 00138000
                                                                        00138300
      *====================================================             00138400
       PROCEDURE                                 DIVISION.              00138500
      *====================================================             00138600
      *-----------------------------------------------------            00138700
       0000-PRINCIPAL                             SECTION.              00138800
      *-----------------------------------------------------            00138900
           PERFORM 1000-INICIALIZAR.                                    00139000
           PERFORM 2000-PROCESSAR.                                      00139100
           PERFORM 3000-FINALIZAR.                                      00139300
           STOP RUN.                                                    00139400
      *-----------------------------------------------------            00139500
       0000-99-FIM.                                  EXIT.              00139600
      *-----------------------------------------------------            00139700
                                                                        00139800
      *-----------------------------------------------------            00139900
       1000-INICIALIZAR                           SECTION.              00140000
      *-----------------------------------------------------            00150000
            MOVE 'PROGX'             TO WRK-PROGRAMA.                   00152000
            MOVE '1000 '             TO WRK-SECAO.                      00154000
            MOVE 'ERRO NO OPEN'      TO WRK-MENSAGEM.                   00155000
            MOVE '35'                TO WRK-STATUS.                     00156000
             PERFORM 9000-TRATA-ERROS.                                  00157000
      *-----------------------------------------------------            00157900
       1000-99-FIM.                                  EXIT.              00158000
      *-----------------------------------------------------            00158100
                                                                        00158200
      *-----------------------------------------------------            00158300
       2000-PROCESSAR                             SECTION.              00158400
      *-----------------------------------------------------            00158500
           MOVE 'PROGX'             TO WRK-PROGRAMA.                    00158600
           MOVE '2000'              TO WRK-SECAO.                       00158700
           MOVE 'ERRO NO READ'      TO WRK-MENSAGEM.                    00158800
           MOVE '47'                TO WRK-STATUS.                      00158900
             PERFORM 9000-TRATA-ERROS.                                  00159000
      *-----------------------------------------------------            00160200
       2000-99-FIM.                                  EXIT.              00160300
      *-----------------------------------------------------            00160400
                                                                        00160500
      *-----------------------------------------------------            00160600
       3000-FINALIZAR                             SECTION.              00160700
      *-----------------------------------------------------            00160800
      *-----------------------------------------------------            00162400
       3000-99-FIM.                                  EXIT.              00162500
      *-----------------------------------------------------            00162600
                                                                        00164800
      *-----------------------------------------------------            00164900
       9000-TRATA-ERROS                           SECTION.              00165000
      *-----------------------------------------------------            00165100
           CALL 'GRAVALOG' USING WRK-DADOS.                             00165200
      *-----------------------------------------------------            00165300
       9000-99-FIM.                                  EXIT.              00165400
      *-----------------------------------------------------            00165500
