      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. REL2201.                                             00040000
      *===================================================*             00050000
      *  AUTOR   : VICTOR LEAL                            *             00060000
      *  EMPRESA : FOURSYS                                *             00070000
      *  OBJETIVO: EXIBIR RELATORIO PRODUTOS COM LRECL=29 *             00080000
      *===================================================*             00081000
      *---------------------------------------------------*             00081100
      *  ARQUIVOS:                                        *             00081200
      *  DDNAME             I/O           INCLUDE/BOOK    *             00081300
      *  PRODUTOS            I             ---------      *             00081400
      *====================================================             00083000
       ENVIRONMENT                               DIVISION.              00084000
      *====================================================             00085000
       CONFIGURATION                             SECTION.               00086000
       SPECIAL-NAMES.                                                   00087000
           DECIMAL-POINT  IS COMMA.                                     00088000
                                                                        00089000
       INPUT-OUTPUT                              SECTION.               00090000
       FILE-CONTROL.                                                    00100000
           SELECT PRODUTOS ASSIGN TO PRODUTOS                           00110000
               FILE STATUS IS WRK-FS-PRODUTOS.                          00120000
                                                                        00130300
      *====================================================             00130400
       DATA                                      DIVISION.              00130500
      *====================================================             00130600
      *-----------------------------------------------------            00130700
       FILE                                      SECTION.               00130800
      *-----------------------------------------------------            00130900
       FD PRODUTOS                                                      00131000
           RECORDING MODE IS F                                          00132000
           LABEL RECORD IS STANDARD                                     00133000
           BLOCK CONTAINS 0 RECORDS.                                    00133100
                                                                        00133200
       01 FD-PRODUTOS.                                                  00133300
          05 FD-CODIGO       PIC X(04).                                 00133400
          05 FD-ITEM         PIC X(20).                                 00133500
          05 FD-QUANT        PIC X(05).                                 00133600
                                                                        00137000
      *-----------------------------------------------------            00137100
       WORKING-STORAGE                           SECTION.               00137200
      *-----------------------------------------------------            00137300
           COPY '#GLOG'.                                                00137400
                                                                        00137500
      *-----------------------------------------------------            00137600
       01 FILLER PIC X(48) VALUE                                        00137700
           '--------------VARIAVEIS PARA FILE STATUS-----'.             00137800
      *-----------------------------------------------------            00137900
       77 WRK-FS-PRODUTOS    PIC 9(02).                                 00138000
      *====================================================             00138100
       PROCEDURE                                 DIVISION.              00138200
      *====================================================             00139000
      *-----------------------------------------------------            00139100
       0000-PRINCIPAL                             SECTION.              00139200
      *-----------------------------------------------------            00139300
           PERFORM 1000-INICIALIZAR.                                    00139400
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-PRODUTOS                 00139500
                    EQUAL 10.                                           00139600
           PERFORM 3000-FINALIZAR.                                      00139700
           STOP RUN.                                                    00139800
      *-----------------------------------------------------            00139900
       0000-99-FIM.                                  EXIT.              00140000
      *-----------------------------------------------------            00140100
                                                                        00140200
      *-----------------------------------------------------            00140300
       1000-INICIALIZAR                           SECTION.              00140400
      *-----------------------------------------------------            00140500
           OPEN INPUT PRODUTOS.                                         00140600
             PERFORM 4000-TESTAR-STATUS.                                00140800
           READ PRODUTOS.                                               00140900
           IF WRK-FS-PRODUTOS EQUAL 10                                  00141000
            DISPLAY 'FINAL DE ARQUIVO'                                  00142000
           END-IF.                                                      00143000
      *-----------------------------------------------------            00144000
       1000-99-FIM.                                  EXIT.              00145000
      *-----------------------------------------------------            00146000
                                                                        00147000
      *-----------------------------------------------------            00148000
       2000-PROCESSAR                             SECTION.              00149000
      *-----------------------------------------------------            00150000
           DISPLAY FD-PRODUTOS.                                         00151000
           READ PRODUTOS.                                               00152000
      *-----------------------------------------------------            00158000
       2000-99-FIM.                                  EXIT.              00159000
      *-----------------------------------------------------            00160000
                                                                        00160100
      *-----------------------------------------------------            00160200
       3000-FINALIZAR                             SECTION.              00160300
      *-----------------------------------------------------            00160400
           CLOSE PRODUTOS.                                              00160500
      *-----------------------------------------------------            00160600
       3000-99-FIM.                                  EXIT.              00160700
      *-----------------------------------------------------            00160800
                                                                        00160900
      *-----------------------------------------------------            00161000
       4000-TESTAR-STATUS                         SECTION.              00162000
      *-----------------------------------------------------            00163000
           IF WRK-FS-PRODUTOS NOT EQUAL 0                               00163100
             MOVE 'REL2201'             TO WRK-PROGRAMA                 00163200
             MOVE '4000'                TO WRK-SECAO                    00163300
             MOVE 'ERRO NO OPEN PRODUT' TO WRK-MENSAGEM                 00163400
             MOVE WRK-FS-PRODUTOS       TO WRK-STATUS                   00163500
             PERFORM 9000-ERRO                                          00163600
           END-IF.                                                      00163700
      *-----------------------------------------------------            00163800
       4000-99-FIM.                                  EXIT.              00163900
      *-----------------------------------------------------            00164000
                                                                        00166900
      *-----------------------------------------------------            00167000
       9000-ERRO                                  SECTION.              00167100
      *-----------------------------------------------------            00167200
           DISPLAY WRK-MENSAGEM.                                        00167300
            CALL 'GRAVALOG' USING WRK-DADOS.                            00167400
           GOBACK.                                                      00167500
      *-----------------------------------------------------            00167600
       9000-99-FIM.                                  EXIT.              00167700
      *-----------------------------------------------------            00167800
