      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. REL2202.                                             00040000
      *===================================================*             00050002
      *  AUTOR   : VICTOR LEAL                            *             00060002
      *  EMPRESA : FOURSYS                                *             00070002
      *  OBJETIVO: EXIBIR RELATORIO PRODUTOS COM LRECL=29 *             00080002
      *            MOSTRANDO O NUMERO DE PRODUTOS         *             00080102
      *            ACUMULADOS.                            *             00080202
      *---------------------------------------------------*             00080303
      *  ARQUIVOS:                                        *             00080403
      *  DDNAME             I/O           INCLUDE/BOOK    *             00080503
      *  PRODUTOS            I             ---------      *             00080603
      *===================================================*             00081003
                                                                        00082000
      *====================================================             00083000
       ENVIRONMENT                               DIVISION.              00084001
      *====================================================             00085000
       CONFIGURATION                             SECTION.               00086000
       SPECIAL-NAMES.                                                   00087000
           DECIMAL-POINT  IS COMMA.                                     00088000
                                                                        00089000
       INPUT-OUTPUT                              SECTION.               00090000
       FILE-CONTROL.                                                    00100000
           SELECT PRODUTOS ASSIGN TO PRODUTOS                           00110000
               FILE STATUS IS WRK-FS-PRODUTOS.                          00120000
                                                                        00130000
      *====================================================             00130100
       DATA                                      DIVISION.              00130200
      *====================================================             00130300
      *-----------------------------------------------------            00130400
       FILE                                      SECTION.               00130500
      *-----------------------------------------------------            00130600
       FD PRODUTOS                                                      00130700
           RECORDING MODE IS F                                          00130800
           LABEL RECORD IS STANDARD                                     00130900
           BLOCK CONTAINS 0 RECORDS.                                    00131000
                                                                        00132000
       01 FD-PRODUTOS.                                                  00133000
          05 FD-CODIGO       PIC X(04).                                 00133100
          05 FD-ITEM         PIC X(20).                                 00133200
          05 FD-QUANT        PIC X(05).                                 00133300
                                                                        00133400
      *-----------------------------------------------------            00133500
       WORKING-STORAGE                           SECTION.               00133600
      *-----------------------------------------------------            00133700
           COPY '#GLOG'.                                                00133800
                                                                        00133903
      *----------------------------------------------------             00134003
       01 FILLER PIC X(48) VALUE                                        00134103
           '--------------VARIAVEIS PARA FILE STATUS-----'.             00134203
      *----------------------------------------------------             00134303
       77 WRK-FS-PRODUTOS    PIC 9(02).                                 00134500
      *----------------------------------------------------             00134603
       01 FILLER PIC X(48) VALUE                                        00134703
           '--------------VARIAVEIS PARA ACUMULAR--------'.             00134803
      *----------------------------------------------------             00134903
       77 WRK-ACUM-LIDOS     PIC 9(02).                                 00135000
      *====================================================             00135100
       PROCEDURE                                 DIVISION.              00136000
      *====================================================             00137000
      *-----------------------------------------------------            00138000
       0000-PRINCIPAL                             SECTION.              00139000
      *-----------------------------------------------------            00139100
           PERFORM 1000-INICIALIZAR.                                    00139200
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-PRODUTOS                 00139300
                    EQUAL 10.                                           00139400
           PERFORM 3000-FINALIZAR.                                      00139500
           STOP RUN.                                                    00139600
      *-----------------------------------------------------            00139700
       0000-99-FIM.                                  EXIT.              00139800
      *-----------------------------------------------------            00139900
                                                                        00140000
      *-----------------------------------------------------            00140100
       1000-INICIALIZAR                           SECTION.              00140200
      *-----------------------------------------------------            00140300
           OPEN INPUT PRODUTOS.                                         00140400
             PERFORM 4000-TESTAR-STATUS.                                00140500
           READ PRODUTOS.                                               00140600
           IF WRK-FS-PRODUTOS EQUAL 10                                  00140700
            DISPLAY 'FINAL DE ARQUIVO'                                  00140800
           END-IF.                                                      00140900
      *-----------------------------------------------------            00141000
       1000-99-FIM.                                  EXIT.              00142000
      *-----------------------------------------------------            00143000
                                                                        00144000
      *-----------------------------------------------------            00145000
       2000-PROCESSAR                             SECTION.              00146000
      *-----------------------------------------------------            00147000
           ADD 1 TO WRK-ACUM-LIDOS.                                     00147100
            DISPLAY FD-PRODUTOS.                                        00148000
           READ PRODUTOS.                                               00149000
      *-----------------------------------------------------            00150000
       2000-99-FIM.                                  EXIT.              00151000
      *-----------------------------------------------------            00152000
                                                                        00153000
      *-----------------------------------------------------            00154000
       3000-FINALIZAR                             SECTION.              00155000
      *-----------------------------------------------------            00156000
           CLOSE PRODUTOS.                                              00157000
           DISPLAY 'REGISTROS LIDOS:'  WRK-ACUM-LIDOS.                  00157100
      *-----------------------------------------------------            00158000
       3000-99-FIM.                                  EXIT.              00159000
      *-----------------------------------------------------            00160000
                                                                        00160100
      *-----------------------------------------------------            00160200
       4000-TESTAR-STATUS                         SECTION.              00160300
      *-----------------------------------------------------            00160400
           IF WRK-FS-PRODUTOS NOT EQUAL 0                               00160500
             MOVE 'REL2202'             TO WRK-PROGRAMA                 00160600
             MOVE '4000'                TO WRK-SECAO                    00160700
             MOVE 'ERRO NO OPEN PRODUT' TO WRK-MENSAGEM                 00160800
             MOVE WRK-FS-PRODUTOS       TO WRK-STATUS                   00160900
             PERFORM 9000-ERRO                                          00161000
           END-IF.                                                      00162000
      *-----------------------------------------------------            00163000
       4000-99-FIM.                                  EXIT.              00163100
      *-----------------------------------------------------            00163200
                                                                        00163300
      *-----------------------------------------------------            00163400
       9000-ERRO                                  SECTION.              00163500
      *-----------------------------------------------------            00163600
           DISPLAY WRK-MENSAGEM.                                        00163700
            CALL 'GRAVALOG' USING WRK-DADOS.                            00163800
           GOBACK.                                                      00163900
      *-----------------------------------------------------            00164000
       9000-99-FIM.                                  EXIT.              00165000
      *-----------------------------------------------------            00166000
