//FOUR001X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=FOUR001             00010000
// JCLLIB ORDER=PR.FOUR001.PROCLIB                                      00020000
//COBCOMP  EXEC DFHCOBOL,NOME='RESEXER3'                                00030000
//SYSTERM  DD  SYSOUT=*                                                 00040000
//LKED.SYSIN    DD   *                                                  00050000
  NAME RESEXER3(R)                                                      00060000
//*--------------------------------------------------------------------*00070000
//*          FIM JOB DE COMPILACAO COBOL BATCH                         *00080000
//*--------------------------------------------------------------------*00090000
