//FOUR022X JOB 'COMP COB',TIME=(0,01),MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID 00010098
//EXECUTAR EXEC PGM=FR22CB26                                            00140099
//STEPLIB  DD DSN=PR.FOUR022.OBJ,DISP=SHR                               00150014
//SYSIN    DD *                                                         00160057
276565986 12000003                                                      00170099
