//FOUR022X JOB 'EXEC CO',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010000
//EXECUTA  EXEC PGM=MD022202,PARM='G00220055600000020000'               00020012
//*EXECUTA  EXEC PGM=MD022202,PARM='L002200556'                         00021010
//*EXECUTA  EXEC PGM=MD022202,PARM='R00220055600000070000'              00022011
//*EXECUTA  EXEC PGM=MD022202,PARM='D002200556'                         00023012
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00030000
//EVSA0407 DD   DSN=GR.FOUR022.EVSA0407,DISP=SHR                        00040001
