//FOUR022X JOB 'COMP COB',TIME=(0,01),MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID 00010000
//EXECUTAR EXEC PGM=FR22CB26                                            00020000
//STEPLIB  DD DSN=PR.FOUR022.OBJ,DISP=SHR                               00030000
//SYSIN    DD *                                                         00040000
276565986 12000003                                                      00050000
