//FOUR022X JOB 'EXEC CO',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010000
//STEP01   EXEC PGM=MD022204                                            00020000
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00024000
//EVSA0407 DD   DSN=GR.FOUR022.EVSA0407,DISP=SHR                        00025000
//MOV1207  DD   DSN=GR.FOUR022.MOV1207,DISP=SHR                         00026000
//*EXC1207  DD   DSN=GR.FOUR022.EXC1207,DISP=OLD                        00026104
//EXC1207  DD   DSN=GR.FOUR022.EXCSAIDA(+1),DISP=(NEW,CATLG,DELETE),    00027003
//         LIKE=GR.FOUR022.MOV1207                                      00028003
