//FOUR022X JOB 'EXEC CO',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010000
//EXECUTA  EXEC PGM=MD022203,PARM='000100802000500449'                  00020003
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00024000
//EVSA0407 DD   DSN=GR.FOUR022.EVSA0407,DISP=SHR                        00025000
//SVSA0407 DD   DSN=GR.FOUR022.SVSA0407,DISP=OLD                        00026002
