//FOUR001X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID             00010000
//EXECUTAR EXEC PGM=FR01CB05                                            00020000
//STEPLIB  DD DSN=PR.FOUR001.OBJ,DISP=SHR                               00030000
